{"pageProps":{"content":"\nThe IMLS, the US Institute for Museum and Library Services, has announced that it will be funding a $2M proposal to build a turnkey and cloud-ready Hydra solution over the next 2.5 years. DPLA, Stanford & DuraSpace submitted the joint proposal; alignment with the Hydra community, and distributed input on the design, specification and development is structurally built into the grant.\n\nThe text of the announcement reads:\n\n“The Digital Public Library of America (DPLA), Stanford University, and DuraSpace will foster a greatly expanded network of open-access, content-hosting “hubs” that will enable discovery and interoperability, as well as the reuse of digital resources by people from this country and around the world. At the core of this transformative network are advanced digital repositories that not only empower local institutions with new asset management capabilities, but also connect their data and collections. Currently, DPLA’s hubs, libraries, archives, and museums more broadly use aging, legacy software that was never intended or designed for use in an interconnected way, or for contemporary web needs. The three partners will engage in a major development of the community-driven open source Hydra project to provide these hubs with a new all-in-one solution, which will also allow countless other institutions to easily join the national digital platform.”\n\nThis work provides a wonderful chance to accelerate the convergence of the Hydra community on robust, broadly useful, and common codebase. It also looks likely to rapidly expand the Hydra user base not only in the US but worldwide.  Our congratulations to all concerned!\n","frontmatter":{"title":"IMLS funds collaborative development of “Hydra-in-a-Box”","date":"2015-04-01","categories":["news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"IMLS funds collaborative development of “Hydra-in-a-Box” - News and Events - Samvera","og:title":"IMLS funds collaborative development of “Hydra-in-a-Box” - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/imls-funds-collaborative-development-of-hydra-in-a-box"}},"__N_SSG":true}