{"pageProps":{"content":"\nThere are many ways to see what Samvera Community repositories can do:\n \n* Try out Avalon Media System on the [Avalon Demo site](https://www.avalonmediasystem.org/try-out-avalon)\n\n* See Hyrax in action on the [Hyrax development site](https://dev.nurax.samvera.org/)\n\n* See the [Samvera Community Repository](https://repo.samvera.org/) for an example of a Hyku tenant\n  \n* Watch the [latest Samvera technology and repository demo videos on YouTube](https://youtube.com/playlist?list=PLvnoImgmm7Cf6K3ZdMiXDSwxhmfN6sQJq)\n  \n* Check out the repository examples below or [view the full list of known repositories using Samvera Community-supported technologies](https://samvera.atlassian.net/wiki/spaces/samvera/pages/422319621/Samvera+Implementations+in+production) on the Samvera wiki to learn more about the specific repository solutions they use and other implementation details.\n\n\n* * *\n\n#### Examples of Samvera Community repository solutions in action\n\nAmerican Theological Library Association (ATLA) - [Atla Digital Library](https://dl.atla.com/) provides [Atla](https://www.atla.com/) members and other organizations with access to aggregated theological library collections from across the US.\n\n[British Library Shared Research Repository](https://iro.bl.uk/) - Institutional repositories for UK cultural heritage organisations, currently all Independent Research Organisations (IROs). Content includes a variety of outputs including published works, datasets, 3D models and exhibition material.  Six individual repositories with a unified search layer over the top.\n\n[Carolina Digital Repository (CDR)](https://cdr.lib.unc.edu/) - Institutional Repository for OA articles, journals, student papers, research data, posters, 3d objects, OER and more.\n\nCincinnati University  - [Scholar@UC](https://scholar.uc.edu/) - Self-submission institutional repository.\n\nCornell University - [Southeast Asia Visions](http://seasiavisions.library.cornell.edu/) - A collection of more than 350 European travel accounts of pre-modern Southeast Asia.\n\n[Didómena](https://didomena.ehess.fr/) - École des Hautes Études en Sciences Sociales (EHESS), School of Advanced Studies in the Social Sciences, France. Institutional research data repository. Self-deposit data repository for researchers in humanities and social sciences.\n\n[Digital Commonwealth](https://www.digitalcommonwealth.org/) - historical collections from libraries, museums, and archives across Massachusetts.\n\nThe [Digital Repository of Ireland](https://repository.dri.ie/) - The Digital Repository of Ireland is a national digital repository for Ireland’s humanities, social sciences, and cultural heritage data.\n\n[Duke University Digital Repository](https://repository.duke.edu/) - Digital repository for digitized and born-digital special collections; library purchased and licensed collections (including some ebooks); select University Archives materials.\n\n[Duke University Research Data Repository](https://research.repository.duke.edu/) - Institutional repository for research data.\n\nEmory University - [Emory Electronic Theses and Dissertations (ETD)](https://etd.library.emory.edu/) - Mediated self-deposit repository for theses and dissertations, used by multiple Emory University Schools and departments.\n\n[George Washington University Libraries](https://scholarspace.library.gwu.edu/) - Institutional repository for research and scholarly output, including ETDs.\n\nIndiana University - [Imago](http://imago.indiana.edu/catalog) - Repository for biological research collections. The bulk of the current content is over 150,000 pressed plant specimen images from the Indiana University Herbarium.\n\nIndiana University - [Media Collections Online](https://media.dlib.indiana.edu/) - Central service for AV media collection at Indiana University. Contains media from a large variety of departments and schools at IU, the IU Libraries, and external partners.\n\nIndiana University - [Pages Online](https://pages.dlib.indiana.edu/catalog) - Page turning application for uploading, describing, structuring, and providing access to digitized multi-page items from the IU Libraries collections.\n\n[King's Fund Digital Archive](https://archive.kingsfund.org.uk/) - Digitized publications from the King's Fund from 1898 onwards.\n\n[Linn-Benton Community College Community Archive](http://libarchive.linnbenton.edu/) - CommunityArchive@LBCC is a tool for showcasing and preserving important content created at Linn-Benton Community College.  Our collection focuses on teaching and learning materials (particularly Open Educational Resources) and institutional history.\n\n[MAE, Theater Institute of Barcelona](http://colleccions.cdmae.cat/)\n\n[Northeastern University Repository](http://repository.library.northeastern.edu/)\n\n[Northwestern University AVR](http://media.library.northwestern.edu/) - Avalon-based media system for special collections and course reserves.\n\n[Northwestern University Digital Collections](https://digitalcollections.library.northwestern.edu/)\n\nNorthwestern University Institutional Repository - [ARCH](https://arch.library.northwestern.edu/) - Institutional Repository research output including dissertations, data sets, and published articles.\n\nOregon State University - [ScholarsArchive@OSU](https://ir.library.oregonstate.edu/) - Institutional repository for scholarly content including graduate theses and dissertations, articles, presentations, technical reports, and research datasets.\n\nOregon State University - [Oregon Digital](https://oregondigital.org/) - Collaborative digital collections system for unique digitized and born-digital materials including photographs, articles, sheet music, manuscripts, ephemera, and more.\n\nPrinceton University Library - [Figgy](https://figgy.princeton.edu/) - Staff tool for building digital objects, which are served using IIIF, and embedded in our user-facing applications.  This is a secured site.  [A screencast is available here](https://vimeo.com/334453271).\n\n[Tufts University Digital Library](http://dl.tufts.edu/)\n\nUniversity of Alberta [Education & Research Archive](https://era.library.ualberta.ca/)\n\nUniversity of California Los Angeles - [UCLA Library Digital Collections](https://ursus.library.ucla.edu/) The UCLA Digital Library Program (DLP) serves as the catalyst for the creation, management, and delivery of digital content in support of the UCLA Library mission and goals. The Program provides for the storage and dissemination of digital objects, including text, images, audio, and video in their various digital manifestations and combinations. The UCLA Library provides a web presence for digital collections, and provides storage, backup and digital preservation support for all digital content accepted into, or developed by, the Library.\n\nUniversity of California Santa Barbara [Alexandria Digital Research Library](https://www.alexandria.ucsb.edu/) - Digital collections system for unique digitized and born-digital library materials including photographs, prints, newspapers, maps, audio, sheet music, manuscripts, ETDs, and more.\n\nUniversity of California San Diego [Library Digital Collections](https://library.ucsd.edu/dc)\n\n[University of Hong Kong Libraries Digital Repository](https://digitalrepository.lib.hku.hk/) - A platform for hosting digital contents received into or developed by [HKU Libraries](https://lib.hku.hk/) to support teaching, learning, research and knowledge exchange. The repository provides digitized materials including books, manuscripts, journals, articles, photographs, videos, audio, music scores, ephemera, posters, drawings and more.\n\nThe [University of Hull's digital repository](https://hydra.hull.ac.uk/) which includes a wide range of public material including journal articles and theses. Other categories of content, such as past undergraduate examination papers, are not public.\n\nUniversity of Michigan - [Deep Blue Data](https://deepblue.lib.umich.edu/data) - Research data repository for University of Michigan researchers. Deposit is mediated and access is open to all.\n\nUniversity of Michigan - [Fulcrum](https://www.fulcrum.org/) - Fulcrum is an open source publishing platform that helps publishers present the full richness of their authors' research outputs in a durable, discoverable, accessible and flexible form.\n\nUniversity of Utah - [The Hive](https://hive.utah.edu/) - Institutional research data repository.\n\nUniversity of Virginia - [Libra](http://libra.virginia.edu/) - Institutional Repository research output including dissertations and open scholarship, primarily self-deposit (unmediated workflow).\n\nUniversity of Virginia - [Virgo GIS](http://gis.lib.virginia.edu/): a maps and GIS data repository.\n","frontmatter":{"title":"examples and demos","date":"2023-08-04"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"examples and demos - Repository Solutions - Samvera","og:title":"examples and demos - Repository Solutions - Samvera","og:type":"website","og:url":"https://samvera.org/repository-solutions/examples-and-demos"},"slug":"examples-and-demos"},"__N_SSG":true}