{"pageProps":{"blogPost":{"title":"West Virginia University Libraries Joins the Samvera Community as a Partner","slug":"wvu-samvera-community-partner","publishDate":"2025-05-28T00:00-04:00","content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Samvera Community is delighted to welcome West Virginia University (WVU) Libraries as our newest Community Partner!","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"WVU Libraries has been a longtime user of Samvera technologies, powering a range of impactful digital collections that preserve and share the cultural heritage of West Virginia and the Appalachian region. Their flagship repository, ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://wvhistoryonview.org/"},"content":[{"nodeType":"text","value":"West Virginia History OnView","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":", provides access to more than 54,000 historical photographs. They are also home to the ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://wvfolklife.lib.wvu.edu/"},"content":[{"nodeType":"text","value":"West Virginia Folklife Collection","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":", a statewide initiative supported by the National Endowment for the Arts, which documents the state’s traditional artists and cultural communities through photos, audio, video, and written materials.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"In addition, WVU Libraries is a key partner in the American Congress Digital Archives Portal—a project developed using Samvera components and supported by over $1.5 million in funding from the National Endowment for the Humanities, Lyrasis, and congressional appropriations. This initiative exemplifies WVU’s leadership in developing scalable, collaborative digital repository solutions.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"Over the past year, WVU Libraries undertook a comprehensive review of their digital infrastructure and developed a new plan to ensure the sustainability of their archives and cultural heritage work. As part of this strategy, they’ve partnered with a Samvera Service Provider Partner, ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://www.notch8.com/"},"content":[{"nodeType":"text","value":"Notch8","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":", to develop a Hyku repository and made the strategic decision to deepen their engagement with the Samvera Community.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"“We have benefitted greatly from the Samvera Community over many years,” said Jessica McMillen, Director of Systems at WVU Libraries. “As we move forward with new development and infrastructure, joining as a Community Partner helps ensure the long-term success of our projects and supports the sustainability of the open-source ecosystem that makes this work possible.”","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"WVU’s commitment to the community is already in motion: their developer Tracy McCormick was recently named the Hyku Community Developer through the Hyku for Consortia project. In this role, Tracy will be contributing directly to the Hyku codebase to the benefit of all Hyku repositories.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Samvera Community is thrilled to welcome WVU Libraries to our Partnership, and we look forward to their continued leadership and collaboration. Their involvement enriches our collective efforts to build robust, sustainable, and open digital repository solutions for libraries, archives, and cultural institutions worldwide.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"Are you interested in supporting critical infrastructure by becoming a Samvera Community Partner?","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":" ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://samvera.atlassian.net/wiki/spaces/samvera/pages/1872461833"},"content":[{"nodeType":"text","value":"Learn more on the Samvera wiki","marks":[],"data":{}}]},{"nodeType":"text","value":" or contact Heather Greer Klein, heather@samvera.org. ","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"\n","marks":[],"data":{}}]}]}},"markdownContent":null,"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"West Virginia University Libraries Joins the Samvera Community as a Partner - News and Events - Samvera","og:title":"West Virginia University Libraries Joins the Samvera Community as a Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/wvu-samvera-community-partner"}},"__N_SSG":true}