{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nSamvera's annual Connect conference has gone virtual this year, like so many others.  Nevertheless, we've put together an exciting program of workshops, presentations, posters and community social events that we hope will make up for not being able to meet in person.  The main events are on Friday 10/23 and Monday - Thursday 10/26 - 10/29 with workshops on 10/22.  The conference runs from 11:00am EDT to approximately 2:30pm EDT each day.\n\nYou can find full details of the conference on [**our wiki pages at this link.**](https://wiki.lyrasis.org/display/samvera/Samvera+Connect+2020)  There you'll also find details of our online shop where you can get themed conference goodies to make up for the lack of our usual free conference t-shirt.\n\n**Connect 2020 On-line is free of charge but registration is required. To register:**\n\n1. Create an account on the conference Sched website: [https://sc2020.sched.com/](https://sc2020.sched.com/)\n2. Select the workshops, presentations, and/or community events you will attend and add them to your schedule. **Some workshops have limited seats and are filling up fast!**\n3. During the week of October 12th, all Attendees registered in Sched will be emailed a Zoom webinar registration link. Follow this link to obtain your unique URL to join the conference.  The same URL will work throughout the conference program on Friday 10/23 and Monday - Thursday 10/26 - 10/29.  You may also receive specific connection information for any workshops or community events you've added to your schedule.\n\nQuestions? Email Heather Greer Klein, Samvera Community Manager, [heather.klein@emory.edu](mailto:heather.klein@emory.edu)\n","frontmatter":{"title":"Samvera Connect 2020 On-line is nearly here!","date":"2020-10-09","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Samvera Connect 2020 On-line is nearly here! - News and Events - Samvera","og:title":"Samvera Connect 2020 On-line is nearly here! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/samvera-connect-2020-on-line-is-nearly-here"}},"__N_SSG":true}