{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are delighted to announce that Princeton University Library has become Hydra’s 21st formal Partner.  In their letter of intent, Marvin Bielawski and Jon Stroop write:\n\n“While we are in the early stages of our first Hydra project, we have big plans. Our initial project will be to facilitate a high-throughput digitization and cataloging project of Latin American Ephemera which has been partially funded by the Council on Library and Information Resources (“CLIR”). The ability to model complex workflows makes Hydra a perfect fit for this project. We will follow this project with a set of workflow and ingest tools for our imaging studios, once again building on the excellent foundations already set up by the existing partners. Future projects will involve work with born-digital materials, geospatial data, special collections and online exhibitions, all of which we know are shared concerns among at least subsets of the partners, and will provide for fruitful collaborations.”\n\nWelcome, Princeton, to the growing list of Hydra Partners.  We look forward  to many years of collaboration.\n","frontmatter":{"title":"21 today! Princeton joins Hydra as a Partner","date":"2014-02-03","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"21 today! Princeton joins Hydra as a Partner - News and Events - Samvera","og:title":"21 today! Princeton joins Hydra as a Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/21-today-princeton-joins-hydra-as-a-partner"}},"__N_SSG":true}