{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nOf interest to the Hydra community, this post from Jon Dunn (Indiana University) and Stu Baker (Northwestern University):\n\nWe are pleased to announce that Release 3.0 of the Avalon Media System is now available, brought to you by our talented project team members at Indiana and Northwestern, with support from the Institute of Museum and Library Services. Both IU and Northwestern will be using this release to set up production environments, and we hope other institutions will join us.\n\nRelease 3.0 adds the following capabilities:\n\n- provide authorization for item access from your learning management system by integrating Avalon as an LTI tool (Learning Tools Interoperability is a standard used by many course management systems)\n- embed Avalon’s media player in other web pages using embed codes\n- configure Avalon to delete, move, or do nothing to your master files after they are transcoded\n- track location of master files and derivatives in Fedora\n- configure Avalon to assign a permanent URL (e.g., PURL or Handle) when an item is published\n- quickly import previously transcoded derivatives\n- maintain privacy of dropboxes between collections\n- numerous media player bug fixes and improvements\n\nThere are several options for exploring release 3.0. You can try it out on our public test server. You can also download and install a preconfigured Avalon virtual machine image, perform a step-by-step installation, or find out how to download our source code from Github. More information on all of these options is available at [http://www.avalonmediasystem.org/software](http://www.avalonmediasystem.org/software)\n\nWe look forward to feedback on this release via the avalon-discuss-l list. If you haven’t already signed up for the Avalon discussion list, you can find out how to do so at [http://www.avalonmediasystem.org/connect](http://www.avalonmediasystem.org/connect)\n","frontmatter":{"title":"Avalon Media System Release 3.0","date":"2014-05-13","categories":["news","software-updates"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Avalon Media System Release 3.0 - News and Events - Samvera","og:title":"Avalon Media System Release 3.0 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/avalon-media-system-release-3-0"}},"__N_SSG":true}