{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are pleased to announce the draft program for Hydra Connect #2.  The meeting is being held at Case Western Reserve University in Cleveland, Ohio, from Tuesday 30th September to Friday 3rd October, 2014.  The timetable is available from the Connect #2 information page on the Hydra wiki –[https://wiki.duraspace.org/display/hydra/Hydra+Connect+2+-+Fall+2014](https://wiki.duraspace.org/display/hydra/Hydra+Connect+2+-+Fall+2014) – where you can also find further details about the conference and about booking procedures.\n\nHydra Connect #2 is the major Hydra gathering planned for 2014/15. If you’re a Hydra Partner and can attend only one meeting in the 2014/2015 academic year, this should be it.  Adopters of Hydra, or those considering its adoption, who are not Partners are equally welcome to attend and, as you will see from the program, a significant number of the meeting sessions Tuesday to Thursday have been specifically tailored to their needs.\n\nIf you intend coming to this Hydra Connect meeting it is becoming urgent that you book soon!  Over half the tickets for the event have already been sold and the preferential hotel rate that we have negotiated ends on Thursday August 28th.\n","frontmatter":{"title":"Hydra Connect #2 draft program now available – time is running out to book!","date":"2014-08-15","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Hydra Connect #2 draft program now available – time is running out to book! - News and Events - Samvera","og:title":"Hydra Connect #2 draft program now available – time is running out to book! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/hydra-connect-2-draft-program-now-available-time-is-running-out-to-book"}},"__N_SSG":true}