{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nThe University of Virginia is pleased to announce a two-year award in the amount of $1,000,000 from Arcadia—a charitable fund of philanthropists Lisbet Rausing and Peter Baldwin—in support of the “Advancing Hyku: Open Source Institutional Repository Platform Development” project.\n\nThrough this project, the University of Virginia and its partner institutions—Ubiquity Press and the British Library—will support the growth of open access through institutional repositories. Working with the global open infrastructure community, the partners will introduce significant structural improvements and new features to the Samvera Community’s Hyku Institutional Repository platform. Read the entire announcement [at this link](https://news.library.virginia.edu/2019/10/15/hyku-open-source-institutional-repository-development-partnership-awarded-1m-arcadia-grant-to-improve-open-scholarship-infrastructure/).\n","frontmatter":{"title":"Hyku Open Source Institutional Repository Development partnership awarded $1M Arcadia grant to improve open scholarship infrastructure","date":"2019-10-16","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Hyku Open Source Institutional Repository Development partnership awarded $1M Arcadia grant to improve open scholarship infrastructure - News and Events - Samvera","og:title":"Hyku Open Source Institutional Repository Development partnership awarded $1M Arcadia grant to improve open scholarship infrastructure - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/hyku-open-source-institutional-repository-development-partnership-awarded-1m-arcadia-grant-to-improve-open-scholarship-infrastructure"}},"__N_SSG":true}