{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nOf interest to many Hydranauts:\n\nThe [Tenth International Conference on Open Repositories](http://www.or2015.net/), OR2015, will be held on June 8-11, 2015 in Indianapolis (Indiana, USA). The organizers are pleased to invite you to contribute to the program. This year’s conference theme is:\n\n**LOOKING BACK, MOVING FORWARD: OPEN REPOSITORIES AT THE CROSSROADS**\n\nOR2015 is the tenth OR conference, and this year’s overarching theme reflects that milestone: Looking Back/Moving Forward: Open Repositories at the Crossroads. It is an opportunity to reflect on and to celebrate the transformative changes in repositories, scholarly communication and research data over the last decade. More critically however, it will also help to ensure that open repositories continue to play a key role in supporting, shaping and sharing those changes and an open agenda for research and scholarship.\n\nThe full call for proposals can be found at [http://www.or2015.net/call-for-proposals/](http://www.or2015.net/call-for-proposals/)\n","frontmatter":{"title":"OR2015 – Call fpr Proposals","date":"2014-11-13","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"OR2015 – Call fpr Proposals - News and Events - Samvera","og:title":"OR2015 – Call fpr Proposals - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/or2015-call-fpr-proposals"}},"__N_SSG":true}