{"pageProps":{"blogPost":null,"markdownContent":{"content":"\n[Samvera Connect 2021 Online](https://www.eventbrite.com/e/samvera-connect-2021-online-tickets-169324663627) is October 18th - 22nd, from 11:00 AM EDT - 2:30 PM EDT.\n\nTwo workshops will be offered on Friday, October 15th, and you can register for them when you [register](https://www.eventbrite.com/e/samvera-connect-2021-online-tickets-169324663627) for Samvera Connect.\n\nThis year’s Connect is online once again and will be better than ever, and offers a great way to learn what’s happening and what’s coming next for the Samvera Community and technologies. [Registration is free and easy!](https://www.eventbrite.com/e/samvera-connect-2021-online-tickets-169324663627)\n\nA few reasons you’ll want to be sure to attend this year:\n\nA **Keynote presentation** on Friday, October 22nd from [Aymar Jean Christian](https://communication.northwestern.edu/faculty/aymar-jean-christian/), an associate professor of communication studies at Northwestern University and a Fellow at the Peabody Media Center. Professor Christian will present “Digital Archiving-in-Process as Reparative Practice”\n\n**Two workshops on October 15th:** Introduction to Samvera Community, Technology, and Values; and Introduction to Valkyrie. You can register for these workshops when you register for the Conference. Seats are limited!\n\nA **wide variety of panels, presentations, and lightning talks from our Community**, across all Samvera technologies and with interesting topics for developers, administrators, and those interested in learning more about Samvera. The schedule will be posted soon!\n\n[Easy registration:](https://www.eventbrite.com/e/samvera-connect-2021-online-tickets-169324663627) You can [register quickly via Eventbrite](https://www.eventbrite.com/e/samvera-connect-2021-online-tickets-169324663627) and you’ll be invited to join the Connect 2021 Sched, where you’ll be able to browse sessions and create your own schedule as soon as it is posted. You’ll also be able to access webinar links directly from Sched during the conference.\n\nYou can still [submit lightning talks](https://forms.gle/8iua8Pwy2r4WCEQt6) and [online posters](https://forms.gle/Cz3QQk2p71JhA6dz6) for Connect through September 30th.\n","frontmatter":{"title":"Registration now open for Samvera Connect 2021 Online","date":"2021-09-22","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Registration now open for Samvera Connect 2021 Online - News and Events - Samvera","og:title":"Registration now open for Samvera Connect 2021 Online - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/registration-now-open-for-samvera-connect-2021-online"}},"__N_SSG":true}