{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are pleased to announce that Samvera's 2019 Connect conference will be held at Washington University in St. Louis, St. Louis Missouri, during the week beginning Monday, October 21st.\n\nWe realize this is the week following DLF and that having two conferences many of our community typically attend so close together can be problematic—but better than having them conflict outright, and these dates were the best remaining option.  We will work in future years to have our organizations coordinate on scheduling.\n\nMonday the 21st will be a Samvera Partner meeting.  Connect workshops will take place on Tuesday the 22nd and the Connect conference itself will run from the morning of Wednesday 23rd through Friday the 25th.\n\nWe anticipate that registration will open early in June—in the meantime please hold the dates and feel free to share this information with others!\n\nAdvance notice that the subsequent Connect will be in the fall of 2020 at the University of California Santa Barbara.\n\nOn behalf of the Steering and 2019 Host Committees,\n\nAndrew Rouner (Chair, host committee)  \nRichard Green (Chair, Samvera Steering Group)\n","frontmatter":{"title":"Save the dates! Samvera Connect 2019","date":"2019-01-14","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Save the dates! Samvera Connect 2019 - News and Events - Samvera","og:title":"Save the dates! Samvera Connect 2019 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/save-the-dates-samvera-connect-2019"}},"__N_SSG":true}