{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nOf interest to the community:\n\nIMMEDIATE RELEASE\n\n**Open Repositories 2015 DEVELOPER TRACK**\n\nJune 8-11, 2015, Indianapolis, Indiana, [http://www.or2015.net](http://www.or2015.net/)\n\n\\*\\*\\* Deadline 13th March 2015 \\*\\*\\*\n\n**Cool Tools, Daring Demos and Fab Features**\n\nThe OR2015 developer track presents an opportunity to share the latest developments across the technical community. We will be running informal sessions of presentations and demonstrations showcasing community expertise and progress:\n\nWhat cool development tools, frameworks, languages and technologies could you not get on without?\n\nIs there a particular technique or process that you find apt for solving particular day-to-day repository problems?  Demonstrate it to the community.  Extra credit for command-line shenanigans and live debugging.\n\nWhat new features (however small) have you added to your organisation’s repository?  What technologies were used and how did you arrive at your solution?\n\nPresentations will be flexibly timed (5 to 20 minutes). Live demos, code repositories, ssh, hacking and audience participation are encouraged.\n\nSubmissions should take the form of a title and short paragraph detailing what will be shared with the community (including the specific platform and/or technologies you will be showcasing). Please also give an estimate of the duration of your demonstration.\n\nSubmit your proposal here: [https://www.conftool.com/or2015/](https://www.conftool.com/or2015/) by March 13, 2015\n\n**Ideas Challenge**\n\nThe Developer Challenge this year has been replaced by the more inclusive IDEAS CHALLENGE. We would like to encourage teams to form before and during the conference to propose an innovative solution to a real-world problem that repository users currently face.  Each team should include members from both the developer and user community, and represent more than one institution.\n\nTeams’ ideas will be presented to the conference and prizes will be awarded based on the nature of the problem, the quality of the solution and the make-up of the team. Find out more at [www.or2105.net/ideaschallenge](http://www.or2105.net/ideaschallenge)\n\nFor inquiries, please contact the Developer Track Co-Chairs, Adam Field and Claire Knowles  at af05\\[AT\\]ecs.soton.ac.uk and claire.knowles\\[AT\\]ed.ac.uk\n","frontmatter":{"title":"Share your Cool Tools, Daring Demos and Fab Features at Open Repositories 2015","date":"2015-02-11","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Share your Cool Tools, Daring Demos and Fab Features at Open Repositories 2015 - News and Events - Samvera","og:title":"Share your Cool Tools, Daring Demos and Fab Features at Open Repositories 2015 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/share-your-cool-tools-daring-demos-and-fab-features-at-open-repositories-2015"}},"__N_SSG":true}