{"pageProps":{"blogPost":null,"markdownContent":{"content":"\n\\*\\*\\* Reminder!  Only 10 more days to submit workshop proposals \\*\\*\\*\n\nThe second, annual Hydra Connect meeting will be taking place at Case Western Reserve University in Cleveland, Ohio from Tuesday September 30th to Friday October 3rd, 2014. (Save the dates in your diary if you haven’t already!) The Tuesday will be an optional day of workshops whilst the meeting proper on Wednesday – Friday will be a mixture of plenary, poster/demo and breakout sessions.  Further preliminary details of Hydra Connect #2 can be found at [Hydra Connect 2 – Fall 2014](https://wiki.duraspace.org/display/hydra/Hydra+Connect+2+-+Fall+2014)\n\nBooking for the event will open in mid-June, at which point people will need to be able to make a decision whether to come for the workshop day; thus we need to have the workshops organized in the next few weeks. This email is an invitation for you to submit a workshop proposal; workshop slots of 1 hour, 2 hours, half day and full day will be available.\n\nIf you wish to offer a workshop, please send us an e-mail detailing:\n\n- the title of the proposed workshop\n- the name(s) and affiliation of the workshop leader(s)\n- the time slot required for the workshop\n- the maximum number of participants you feel comfortable with (subject to space being available)\n- the main learning outcome(s) planned (“When people leave the workshop they will know how to / be able to…”)\n\nProposals must be received by EOB Monday 26th May at [hydra-connect@googlegroups.com](mailto:hydra-connect@googlegroups.com). Successful proposals will be notified on or before Monday 2nd June.\n\nPlease feel free to forward this email to interested colleagues.\n\nPosted in [Events](https://projecthydra.org/category/events/), [News](https://projecthydra.org/category/news/)\n","frontmatter":{"title":"Workshop proposals for Connect 2 – a reminder!","date":"2014-05-19","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Workshop proposals for Connect 2 – a reminder! - News and Events - Samvera","og:title":"Workshop proposals for Connect 2 – a reminder! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/workshop-proposals-for-connect-2-a-reminder"}},"__N_SSG":true}