{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are excited to announce Washington University of St Louis (WUSTL) as a Hydra Partner!\n\nAt HydraConnect 2015, Andrew Rouner and Chris Freeland expressed interest in getting more deeply involved in Hydra and moving toward partnership. That fall, WUSTL partnered with DCE and went into production with their “Goldenseal” repository ([http://repository.wustl.edu](http://repository.wustl.edu/)) in February, followed quickly by their production instance of Avalon ([http://streamingvideo.wustl.edu](http://streamingvideo.wustl.edu/)) in March. Andrew shared “These launch efforts concluded with a Hydra “Stop and Learn” event we held May 13th, aimed primarily at WU personnel but extending to colleagues from various cultural organizations regionally.  The event featured sessions on an overview of Hydra, a closer look at the technology stack, a review of the Hydra community development model, and a poster session (a la HydraConnect) on subjects we currently are now or are hoping to explore with Hydra.”  Additionally they have become involved in Hydra interest and working groups.\n\nThis represents not only major development efforts and engagement within the Hydra Community but also acting as strong advocates among regional cultural organizations. Join us in welcoming Washington University of St Louis and see everyone at Hydra Connect 2016!\n","frontmatter":{"title":"WUSTL becomes a Hydra Partner","date":"2016-08-04","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"WUSTL becomes a Hydra Partner - News and Events - Samvera","og:title":"WUSTL becomes a Hydra Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/wustl-becomes-a-hydra-partner"}},"__N_SSG":true}