{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nA project has recently been announced which is a partnership between George Mason University (Zotero) and Penn State University, with the goal of further customizing Zotero and creating a linkage between Zotero and Hydra-based repositories.  It will add functionality to the Zotero client software to allow users to assert authorship over their own scholarship and to indicate whether they hold the copyright to such materials. It will also develop a pluggable backend for Zotero that will allow any repository to draw such content from the Zotero ecosystem. The first implementation will involve linking Penn State’s institutional repository, ScholarSphere, a Fedora repository built on a Hydra-based platform.  The results of this collaboration will provide open-source code for others in the Hydra community and an open API for adopters of other repository software (e.g., DSpace, Islandora, EPrints) to link institutional and subject repositories to Zotero.\n\nThe full announcement [can be found here.](http://news.psu.edu/story/312098/2014/04/15/academics/penn-state-awarded-mellon-grant-study-personal-scholarly-archiving)\n","frontmatter":{"title":"Zotero to link to Hydra","date":"2014-04-11","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Zotero to link to Hydra - News and Events - Samvera","og:title":"Zotero to link to Hydra - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/zotero-to-link-to-hydra"}},"__N_SSG":true}