{"pageProps":{"content":"\nWe are delighted to announce that the University of California at Santa Barbara has become the latest Hydra Partner.\n\nUC Santa Barbara has been successfully running the Alexandria Digital Research Library (ADRL) using a production instance of Hydra since 2013, at [http://alexandria.ucsb.edu](http://alexandria.ucsb.edu).  The repository initially launched hosting Electronic Theses and Dissertations (ETDs) and has grown to include various born digital and digitized archival images.  Most recently they have implemented access to their collection of more than 10,000 wax cylinder recordings held by the Department of Special Research Collections.\n\nThe UC Santa Barbara team have been active participants in the community, not only attending every Hydra Connect to-date, but also by hosting community events such as Hydra Camp and the first West Coast regional Hydra meet up.\n\nThe team is putting the final touches on a release of ADRL that will provide access to digitized versions of their scanned map collections.  This release will highlight the use of Hydra to navigate complex object relationships and leverage Open SeaDragon and IIIF technologies to provide deep zoom interaction with high-resoultion scans.  This functionality will be rolled out later this year with an even larger GIS initiative following shortly after.\n\nWe welcome UCSB to the Partnership and look forward to even more collaboration with them in the future!\n","frontmatter":{"title":"UC Santa Barbara joins the Hydra Partners","date":"2017-05-01","categories":["news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"UC Santa Barbara joins the Hydra Partners - News and Events - Samvera","og:title":"UC Santa Barbara joins the Hydra Partners - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/uc-santa-barbara-joins-hydra-partners"}},"__N_SSG":true}