{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are delighted to announce that Emory University has become a formal Samvera Partner.  Emory University Libraries have been working with Samvera since 2014 and, in that time, have demonstrated considerable involvement with our Community.  As well as working with Data Curation Experts to stand up one of the first production Hyrax systems, a repository for electronic theses and dissertations (ETDs) at [https://etd.library.emory.edu](https://etd.library.emory.edu), Emory staff have been actively involved in a number of Samvera Working and Interest Groups.  It is their intention to develop an entire local ecosystem based on the Hyrax gem to manage a wide range of digital assets.  Rosalyn Metz, Emory’s Director of Library Technology and Digital Strategies, writes \"While there is much about the Samvera Community that appeals to Emory University Libraries, chief among these is the ability to work with Samvera Partners to go even further than we have been able to in the past.\"\n\nWe look forward to a long and productive working relationship with the team at Emory University and we welcome them into Samvera Partnership.\n","frontmatter":{"title":"Emory is the latest Samvera Partner","date":"2017-12-18","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Emory is the latest Samvera Partner - News and Events - Samvera","og:title":"Emory is the latest Samvera Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/emory-latest-samvera-partner"}},"__N_SSG":true}