{"pageProps":{"blogPost":{"title":"Samvera Community Welcomes Amigos Library Services as Newest Service Provider Partner","slug":"amigos-new-partner","publishDate":"2025-08-13T00:00-04:00","content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Samvera Community is pleased to announce that ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://www.amigos.org/node/8761"},"content":[{"nodeType":"text","value":"Amigos Library Services","marks":[{"type":"underline"},{"type":"bold"}],"data":{}}]},{"nodeType":"text","value":" (Amigos)","marks":[{"type":"bold"}],"data":{}},{"nodeType":"text","value":" has joined as our newest ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://samvera.org/the-community/service-providers"},"content":[{"nodeType":"text","value":"Service Provider Partner","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":", reinforcing their commitment to the continued growth and sustainability of Samvera’s open-source solutions.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"Amigos is a 501(c)3 non-profit membership-based organization dedicated to serving libraries through the sharing of collections, services, and opportunities. With nearly 500 members, including public, academic, and special libraries across Texas, Missouri, Arkansas, Oklahoma, New Mexico, Arizona, and Kansas, Amigos is well-positioned to represent the diverse needs of libraries and cultural institutions of diverse sizes and contexts.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"Over the past year, Amigos has been an active collaborator within the Samvera Community, particularly in advancing the ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://hyku.samvera.org/"},"content":[{"nodeType":"text","value":"Hyku","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":" multi-tenant repository platform. Their contributions include the development of new features for the Hyku community version, such as ETD (Electronic Theses and Dissertations) and OER (Open Educational Resources) work types, flexible metadata options, and the integration of Hyrax 5 and its updated dependencies. Amigos staff have also supported the community through product testing, documentation, and infrastructure and deployment solutions.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"As a Samvera Partner, Amigos plans to deepen its engagement by contributing additional code and enhancements, expanding support for testing and documentation, and offering expertise informed by its broad membership base. They also aim to develop a shared Hyku service to help member libraries meet their repository needs while fostering collaborative resource sharing across the region.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"“Amigos’ active participation and technical contributions have already strengthened the Samvera ecosystem,” said Heather Greer Klein, Samvera Community Manager. “We are excited to welcome them as a Partner and look forward to their continued leadership in building sustainable, flexible repository solutions.”","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"In becoming a Partner, Amigos commits to the principles outlined in the Samvera Community’s Bylaws: contributing resources, participating in governance, staying informed on security issues, and helping shape the technical and strategic direction of the community.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Samvera Community extends a warm welcome to Amigos Library Services to Samvera Partnership. ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://samvera.atlassian.net/wiki/spaces/samvera/pages/1872461833/About+Samvera+Partners"},"content":[{"nodeType":"text","value":"Learn more about Samvera Partnership","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":" and how it enables collaboration, powers good open source governance, and ensures the sustainability of our critical shared digital repository infrastructure. ","marks":[],"data":{}}]}]}},"markdownContent":null,"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Samvera Community Welcomes Amigos Library Services as Newest Service Provider Partner - News and Events - Samvera","og:title":"Samvera Community Welcomes Amigos Library Services as Newest Service Provider Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/amigos-new-partner"}},"__N_SSG":true}