{"pageProps":{"content":"\nOf interest to many Hydra folks…\n\n**Open Repositories Conference Update: OR2014 Proposal Deadline Extended**\n\n_A message from the Open Repositories 2014 Conference organizers_\n\n_Helsinki, Finland_ The final deadline for submitting proposals for the Ninth International Conference on Open Repositories (#or2014) has been extended until Monday, Feb. 10, 2014. The conference is scheduled to take place June 9-13 in Helsinki and is being hosted by University of Helsinki‘s twin libraries: Helsinki University Library and the National Library of Finland.\n\nThe theme this year is “Towards Repository Ecosystems” emphasizing the interconnected nature of repositories, institutions, technologies, data and the people who make it all work together. You may review the call for proposals here: [http://or2014.helsinki.fi/?page\\_id=281](https://mail.hull.ac.uk/owa/redir.aspx?C=bX_a3tHb1k2IkkBqZf_CbJi4aHU88dAImKhMwT-zYZz7sWJW-XtWcTkUymL7VnMxqkUxD8joVCQ.&URL=http%3a%2f%2for2014.helsinki.fi%2f%3fpage_id%3d281).\n\nThis year the Open Repositories team will be operating a pilot programme to offer a small number of ‘registration fee only’ scholarships for this conference. Details will be announced on the conference website when registration opens.\n\n**Submit your proposal here: [https://www.conftool.com/or2014/](https://mail.hull.ac.uk/owa/redir.aspx?C=bX_a3tHb1k2IkkBqZf_CbJi4aHU88dAImKhMwT-zYZz7sWJW-XtWcTkUymL7VnMxqkUxD8joVCQ.&URL=https%3a%2f%2fwww.conftool.com%2for2014%2f) by Feb. 10, 2014.**\n\nWe look forward to seeing you at OR2014!\n","frontmatter":{"title":"OR2014 proposal deadline extended","date":"2014-01-30","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"OR2014 proposal deadline extended - News and Events - Samvera","og:title":"OR2014 proposal deadline extended - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/or2014-proposal-deadline-extended"}},"__N_SSG":true}