{"pageProps":{"content":"\nThe Samvera Community is built around a core group of Partners committed to the success of the project and more importantly to the success of each other.  There are also many institutions and individuals that have formally committed to the sustainability of the Community through code contributions, participation in working or interest groups, helping with documentation, design, or planning.  No contribution is too small.  If you are interested in contributing to the Samvera Community or just interested in Samvera in general read more about the Community [here](https://samvera.org/hydra-partners/community-framework/). The number of Samvera Partners has grown steadily worldwide.\n\n<iframe src=\"https://www.google.com/maps/d/u/1/embed?mid=1kLOr2tK3nZyuc49AInv_CtjwF30CzSGT\" width=\"100%\" height=\"600\"></iframe>\n\n<br />\nThe Hydra Project, Samvera's original name, was founded in 2008 by:\n\n- Stanford University\n- University of Virginia\n- University of Hull\n- Fedora (now part of Lyrasis)\n\nquickly augmented by:\n\n- MediaShelf LLC which later evolved into Data Curation Experts\n\nThe three founding universities are still very active and, together with Data Curation Experts, continue to contribute to the work of the Samvera Community.  DuraSpace withdrew from formal Partnership in 2020 following their merger with Lyrasis but is still active in supporting the Community.\n\nAdditional Partners have formally committed themselves to support and further Samvera’s work. Further institutions are working with Samvera and its components.  Many of them are listed on our '[Samvera adopters](https://samvera.org/samvera-adopters/)' page.\n","frontmatter":{"title":"Samvera Partners","date":"2016-12-06"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Samvera Partners - The Community - Samvera","og:title":"Samvera Partners - The Community - Samvera","og:type":"website","og:url":"https://samvera.org/the-community/samvera-partners"},"slug":"samvera-partners"},"__N_SSG":true}