{"pageProps":{"blogPost":{"title":"Samvera Community Welcomes The Ohio State University Libraries as a New Partner","slug":"ohio-state-university-samvera-partner","publishDate":"2024-11-18T00:00-05:00","content":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Samvera Community is thrilled to announce that The Ohio State University Libraries has officially joined as a new Samvera Partner. University Libraries joins thirty other partner organizations in this commitment to the ongoing sustainability of the Samvera Community’s innovative open source repository solutions.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Ohio State University Libraries has been deploying a customized version of Samvera Hyrax for its ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://library.osu.edu/dc"},"content":[{"nodeType":"text","value":"Digital Collections","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":" (DC), providing preservation and access to both digitized and born-digital special collections and archival materials. With over 65,000 records and more than 300,000 files, the DC platform has become a vital resource for the university and its users.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"“The Samvera Community with its open-source platforms is a disrupter in a field of digital repository platforms that are dependent upon vendors,” said Cory Tressler, Assistant Dean for Technology and Digital Programs at The Ohio State University Libraries. “The Samvera Community and the Hyrax platform are valuable resources and we are becoming partners to support and contribute to their continued sustainability and growth.”  ","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"\"We are excited to welcome The Ohio State University Libraries into the Samvera partnership,\" said David Schober, Digital Products Manager at Northwestern University Libraries and the current Samvera Board Chair. \"Their commitment to enhancing the Samvera Hyrax platform and their active participation in our community furthers our shared mission of advancing open-source solutions in digital repositories.\"","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"Ohio State has been actively involved in various Samvera interest and working groups, contributing to initiatives such as the Samvera Metadata Interest Group, the Machine-readable Metadata Modeling Specification (M3) Working Group, and the Hyrax v3.0 Metadata Application Profile Documentation Review Working Group. Through both in-person and virtual engagements, Ohio State has demonstrated its dedication to sharing knowledge and best practices within the community.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The university's Digital Collections have established important collaborations, including sharing selections with the Digital Public Library of America (DPLA). By utilizing Hyrax's parent and child relationship functionality, Ohio State has enriched metadata for notable works, such as the ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://library.osu.edu/dc/collections/f4752x23c?locale=en"},"content":[{"nodeType":"text","value":"George Bellows Record Books and Ledger","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":" and ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://library.osu.edu/dc/collections/x346dj941?locale=en"},"content":[{"nodeType":"text","value":"Medieval and Renaissance Manuscript Fragments","marks":[{"type":"underline"}],"data":{}}]},{"nodeType":"text","value":".","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"The Samvera Community looks forward to collaborating with The Ohio State University Libraries  to continue to build the future of open-source digital repository solutions.","marks":[],"data":{}}]},{"nodeType":"paragraph","data":{},"content":[{"nodeType":"text","value":"Learn more about the Samvera Partners program on the ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"https://samvera.atlassian.net/wiki/spaces/samvera/pages/1872461833/About+Samvera+Partners"},"content":[{"nodeType":"text","value":"Samvera wiki","marks":[],"data":{}}]},{"nodeType":"text","value":", or ","marks":[],"data":{}},{"nodeType":"hyperlink","data":{"uri":"mailto:heather@samvera.org"},"content":[{"nodeType":"text","value":"contact Heather Greer Klein","marks":[],"data":{}}]},{"nodeType":"text","value":", Samvera Community Manager.\n","marks":[],"data":{}}]}]}},"markdownContent":null,"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Samvera Community Welcomes The Ohio State University Libraries as a New Partner - News and Events - Samvera","og:title":"Samvera Community Welcomes The Ohio State University Libraries as a New Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/ohio-state-university-samvera-partner"}},"__N_SSG":true}