{"pageProps":{"content":"\n**Community Profiles**\n\n- [Jane Sandberg, Linn-Benton Community College, Oregon, USA](#01)\n- [Chris Awre, University of Hull, UK](#02)\n\n**Manager Profiles**\n\n- [Esmé Cowles, Princeton University, New Jersey, USA](#03)\n- [Rosalyn Metz, Emory University, Georgia, USA](#04)\n- [Carolyn Caizzi, Northwestern University, Illinois, USA](#05)\n\n* * *\n\n#### Community profiles\n\n#### Jane Sandberg, Linn-Benton Community College, Oregon, USA \n\n**What makes Samvera stand apart from other repository applications?**\nSlick design (in Hyrax).&nbsp; A good community of institutions that have implemented it.\n\n**How has participation in Samvera benefited your library or organization (internally)?**\nWe get a really stable piece of software that doesn't need much tending.\n\n**How has Samvera benefited the users of your library or organization?**\nWe've digitized our school newspaper -- which was previously only accessible in an office on campus. Students writing papers about the history of our college now have access to a ton of primary sources in ways that they never did before.\n\n**What do you get out of the Samvera Community?**\nGood networking with colleagues at much larger and more well-resourced institutions.\n  \n**How often do you talk to other developers, system administrator or librarians in the Samvera Community?**\nMonthly.\n  \n**What have you accomplished within the Samvera development community this year?**\nI have contributed some documentation.\n  \n**Looking back at the past 12-18 months, what have you accomplished locally at your institution thanks to the Samvera technology stack or community?**\nWe implemented an institutional repository at a small community college!\n\n* * *\n\n#### Chris Awre, University of Hull, UK\n\n**What makes Samvera stand apart from other repository applications?**\nTwo aspects: the community aspects of working through the issues we all have about managing our digital collections, sharing ideas and issues to find the best way forward; and the continued move toward making Samvera a repository solution that can support different digital content management use cases as required.\n\n**How has participation in Samvera benefited your library or organization (internally)?**\nThe provision of a stable repository platform for the management of different digital collections, plus a user-friendly and clean user interface supporting access to those collections.\n\n**How has Samvera benefited the users of your library or organization?**\nAccess to digital collections, plus the ability to manage and present outputs (e.g., research data) in ways that suit the content.\n\n**What do you get out of the Samvera Community?**\nThe ability to work with like-minded people at other institutions who share the same goals of creating solutions to manage our digital heritage.\n\n**What do you get out of the Samvera technology stack/ framework?**\nFlexible technologies that bring the best learning and understanding of how to carry out tasks and combine them.\n\n**What has happened within Samvera in the past year or two that you would want someone to know?**\nThe ability for vendors to take the cloud-based Hyku and deliver services in a manageable and sustainable way.\n\n**How often do you talk to other developers, system administrator or librarians in the Samvera Community?** \nEvery couple of weeks\n\n**What have you accomplished within the Samvera development community this year?**\nLed the Marketing WG in taking forward ways we can better market what we are doing in Samvera\n\n**Looking back at the past 12-18 months, what have *you* accomplished locally at your institution thanks to the Samvera technology stack or community?**\nCreated a technical infrastructure based around Hyrax combined with Archivematica to build a digital archive for the UK City of Culture 2017.\n\n* * *\n\n#### Manager profiles\n\n#### Esmé Cowles, Princeton University, New Jersey, USA\n\n**What makes Samvera stand apart from other repository applications?**\nIt is built from components that can be used in custom applications, giving us the flexibility to meet our needs that a pre-built product could never match.\n\n**How has participation in Samvera benefited your library or organization (internally)?**\n It has given us a community of like-minded peers to get help, feedback, and advice from. It has given us 90%-complete solutions to most of our problems, letting us focus on the parts that are particular to our situation instead of reinventing the wheel all the time.\n  \n **How has Samvera benefited the users of your library or organization?**\n It has let us build, review, and publish digital objects much more quickly than we were able to previously. This means that content rarely sits waiting for IT staff, and gets out where users can find it much more quickly and reliably.\n  \n  **What do *you* get out of the Samvera Community?**\n I get a community of peers that I can discuss new ideas with, and see new developments that we can bring to my organization.\n  \n **What has happened within Samvera in the past year or two that you would want someone to know?**\n The community is maturing and formalizing many things that were previously informal. This has brought more focus on sustainability, and taking better care of the shared software we all depend on. Valkyrie is opening up new options for file and metadata storage, and for replacing ActiveFedora (which had become difficult to maintain over time).\n  \n**How do you describe the Return on Investment of community work for your local resources when it comes to Samvera?**\nThere are two key benefits to participating in community development: 1. It is the most direct way of making sure that the community components work the way we want them to. 2. It ensures that the community components are more sustainable, in turn making our applications more sustainable.\n  \n**What collections are you most proud of in your Samvera repository and why?**\nI'm most proud of our audio reserves collection — we were able to migrate this collection from a legacy system very quickly, thanks to the capabilities of Samvera and other related tools (like UniversalViewer).\n  \n**Looking back at the past 12-18 months, what has your institution or organization accomplished locally thanks to the Samvera technology stack or community?**\nMigrating tens of thousands of objects, and millions of pages, from our previous repository to Figgy was fast and relatively painless. We have been able to maintain our current functionality and add support for new content types. We have been able to sustain ingest of more than 100K pages/month. Implementing features like IIIF Manifest generation, drag-and-drop file management, uploading from cloud storage, and integrating with our other discovery applications.\n  \n**How do you tell potential users of Samvera on your campus about Samvera?**\nI describe it as a community-developed open source repository framework — the community development model is the key defining characteristic, as it shows more community commitment than code that is centrally developed.\n\n* * *\n\n#### Rosalyn Metz, Emory University, Georgia, USA\n\n**What makes Samvera stand apart from other repository applications?**\n  It is open source. It is a community of our peers.\n  \n**How has participation in Samvera benefited your library or organization (internally)?**\nIt has allowed us to customize applications to meet our institution's need.\n  \n**How has Samvera benefited the users of your library or organization?**\n  It has given us an easy to use and maintain application.\n  \n**What do you get out of the Samvera Community?**\nCollaboration with our peers. Expertise and knowledge we can't get in isolation.\n  \n**What do you get out of the Samvera technology stack/ framework?**\nRegular updates to Hyrax.\n  \n**What has happened within Samvera in the past year or two that you would want someone to know?**\nWe are evolving the community to make it more durable and accountable.\n  \n**How do you describe the Return on Investment of community work for your local resources when it comes to Samvera?**\nWe're collaborating with our peers. We get more when we do work together.\n  \n**What collections are you most proud of in your Samvera repository and why?**\nRight now we just have ETDs.\n  \n**Looking back at the past 12-18 months, what has your institution or organization accomplished locally thanks to the Samvera technology stack or community?**\nAn updated ETD application.\n  \n**How do you tell potential users of Samvera on your campus about Samvera?**\nWhen talking with leadership I mention the community and peer collaboration.\n\n* * *\n\n#### Carolyn Caizzi, Northwestern University, Illinois, USA\n\n**What makes Samvera stand apart from other repository applications?**\n The community.\n  \n**How has participation in Samvera benefited your library or organization (internally)?**\nParticipation in Samvera has benefited NUL in that we were able leverage the collective wisdom of colleagues at many academic institutions and the shared open codebase to build applications that support image collections, audiovisual collections, and faculty research outputs over the course of the last 9 years.\n  \n**How has Samvera benefited the users of your library or organization?**\nOur image collections are utilized by faculty in the humanities for teaching, our audiovisual collections support the work being done in courses, and students and faculty are able to deposit publications to share with the world in our research repository.\n  \n**What do *you* get out of the Samvera Community?**\nI get the privilege of interacting with people who are committed to creating open source tools that create access to and support the preservation of information so that current and future generations can help understand the past, inform the present, and impact the future. This goal is lofty and the best part of working with the community is that most of us acknowledge all the inherent biases that go into this commitment.\n  \n**What do *you* get out of the Samvera technology stack/ framework?**\nFlexibility to solve local problems that vended solutions may never address.\n  \n**What has happened within Samvera in the past year or two that you would want someone to know?**\n  The Samvera community is vibrant and has grown. This growth offers many opportunities, albeit with some challenges, to make an impact in meeting common needs across institutions.\n  \n **How do you describe the Return on Investment of community work for your local resources when it comes to Samvera?**\n  It is hard to quantify the return on investment and I think does a disservice to what we gain when working with many people across multiple institutions. I tend to look at pull requests and contributors on github repositories if I need some data. I ask the developers and metadata folks to share stories with me of what they have gained personally/professionally.\n  \n**What collections are you most proud of in your Samvera repository and why?**\n  In our IR, here are the papers deposited by faculty person Richard Joseph. Professor Joseph \"has devoted his scholarly career to the study of politics and governance in Africa with a special focus on democratic transitions, state building and state collapse, and conflict resolution.\" In our AV Repository, there are the recordings of the clarinet master class by Robert Marcellus.In our Images/DigiCollections we have many collections I am proud of, including the Overtaking of the Bursar's Office here at Northwestern in 1968.\n","frontmatter":{"title":"Samvera user profiles","date":"2019-10-29"},"sideNav":[{"date":"2021-06-28","slug":"take-a-tour-of-active-samvera-repositories","title":"Samvera Repository Tour"},{"date":"2020-01-23","slug":"samvera-adopters","title":"Samvera Adopters"},{"date":"2019-10-29","slug":"case-study-avalon-at-the-university-of-houston","title":"Case Study: Avalon at the University of Houston"},{"date":"2019-10-29","slug":"samvera-user-profiles","title":"Samvera user profiles"},{"date":"2017-02-13","slug":"case-studies","title":"Case study: Emory University"},{"date":"2016-12-06","slug":"community-framework","title":"Community Framework"},{"date":"2016-12-06","slug":"samvera-partners","title":"Samvera Partners"}],"sideNewsAndEvents":[{"date":"2022-09-08","slug":"2022-Julie-Allinson-Award-Recipient","title":"2022 Julie Allinson Award Recipient"},{"date":"2022-08-01","slug":"Samvera-Partner-Profile-WGBH","title":"Samvera Partner Profile: WGBH"},{"date":"2022-06-15","slug":"call-for-samvera-connect-2022-proposals","title":"Call for Samvera Connect 2022 Proposals"},{"date":"2022-06-13","slug":"samvera-partner-profile-university-of-hull","title":"Samvera Partner Profile: University of Hull"},{"date":"2022-05-19","slug":"samvera-partner-profile-get-to-know-hyku-for-consortia","title":"Samvera Partner Profile: Get to Know Hyku for Consortia"},{"date":"2022-05-16","slug":"announcing-the-release-of-hyku-4-0","title":"Announcing the release of Hyku 4.0"},{"date":"2022-05-11","slug":"samvera-virtual-connect-2022-recordings","title":"Samvera Virtual Connect 2022 recordings"},{"date":"2022-04-25","slug":"program-now-available-for-samvera-virtual-connect-may-4-5-2022","title":"Program now available for Samvera Virtual Connect, May 4-5, 2022"},{"date":"2022-04-06","slug":"call-for-proposals-extended-to-4-15-for-samvera-virtual-connect-2022","title":"Call for Proposals extended to 4/15 for Samvera Virtual Connect 2022"},{"date":"2022-04-05","slug":"samvera-community-2021-annual-report","title":"Samvera Community 2021 Annual Report"},{"date":"2022-03-15","slug":"call-for-proposals-for-samvera-virtual-connect-2022","title":"Call for Proposals for Samvera Virtual Connect 2022"},{"date":"2021-10-04","slug":"see-the-schedule-and-register-for-samvera-connect-2021-online","title":"See the schedule and register for Samvera Connect 2021 Online"},{"date":"2021-09-22","slug":"registration-now-open-for-samvera-connect-2021-online","title":"Registration now open for Samvera Connect 2021 Online"},{"date":"2021-08-31","slug":"call-for-proposals-extended-to-sept-13th-samvera-connect-2021-online","title":"Call for proposals EXTENDED to Sept 13th - Samvera Connect 2021 Online"},{"date":"2021-07-20","slug":"take-a-virtual-tour-of-samvera-repositories","title":"Take a Virtual Tour of Samvera Repositories"}]},"__N_SSG":true}