{"pageProps":{"content":"\nThe Fall Hydra Camp will be hosted by Princeton University Library.\n\nHydra Camp is a great place to bootstrap your Hydra developer skills, kick the tires if you’re considering adopting Hydra, and it’s a great place to learn about more general development and technical topics including:\n\n- Collaborative development on cross-instutional and open source projects\n- Using github for distributed source control, managing feature development, and release management\n- Principles of Test Driven Development including the differences between unit testing, feature testing, TDD, BDD, ATDD and other flavors of testing\n\nThe Camp will cover deploying Hydra to production environments and this will be our first Hydra Camp to offer a preview of Hydra running on Fedora 4.\n\nFull registration details are available online at: [https://hydracamp-princeton2014.eventbrite.com](https://hydracamp-princeton2014.eventbrite.com/). We’re pleased to offer a $50 Early-Bird registration discount on all registrations made prior to July 15th, 2014.  More details about Hydra Camp and sample syllabi are available at [http://curationexperts.com/who-we-are/about/hydra-camp/](http://curationexperts.com/who-we-are/about/hydra-camp/).\n","frontmatter":{"title":"Registration Open for Fall Hydra Camp – August 26-29 – Princeton, NJ","date":"2014-06-11","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Registration Open for Fall Hydra Camp – August 26-29 – Princeton, NJ - News and Events - Samvera","og:title":"Registration Open for Fall Hydra Camp – August 26-29 – Princeton, NJ - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/registration-open-for-fall-hydra-camp-august-26-29-princeton-nj"}},"__N_SSG":true}