{"pageProps":{"content":"\nWe are delighted to announce that booking has opened for the second Hydra Connect meeting which will be held in Cleveland, Ohio this fall.  It will take place at Case Western Reserve University from Tuesday 30th September – Friday 3rd October 2014.  The booking site can be found at [http://connect-cleveland2014.eventbrite.com](http://connect-cleveland2014.eventbrite.com/)\n\nFor folks who haven’t attended a Hydra meeting before, this is our annual opportunity to connect with other Hydra users, find out what Hydra is all about, and get involved; for established Hydranauts it is an opportunity to share experience with friends old and new, and to see what is going on across the Hydrasphere.  There will be plenty for new and prospective adopters of Hydra as well as for established users.\n\nFor full details, a preliminary schedule of events, and details for lodging options, please see the [Hydra Connect event page](https://wiki.duraspace.org/display/hydra/Hydra+Connect+2+-+Fall+2014 \"Ctrl+Click to follow link\") on the Hydra wiki. Participants are resposible for their own travel and lodging arrangements. We have arranged a [special event rate at the Courtyard Marriot](http://www.marriott.com/meeting-event-hotels/group-corporate-travel/groupCorp.mi?resLinkData=CWRU%20Hydra%20Connect%5Eclece%60hychyca%7Chychycb%60139.00%60USD%60false%609/27/14%6010/5/14%608/28/14&app=resvlink&stop_mobi=yes \"Ctrl+Click to follow link\") adjacent to the university campus – see full detials on the event page.\n\nAs a Hydra Partner or user, if you can only make it to one Hydra meeting in the 04/05 year, _this is the one to attend!_\n","frontmatter":{"title":"Booking for Hydra Connect #2 now open!","date":"2014-06-10","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Booking for Hydra Connect #2 now open! - News and Events - Samvera","og:title":"Booking for Hydra Connect #2 now open! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/booking-for-hydra-connect-2-now-open"}},"__N_SSG":true}