{"pageProps":{"content":"\nThe Samvera Community includes a number of commercial firms and individual contractors that offer for-fee services to interested institutions, such as consulting, implementation, hosting, training, and more.\n\nThis page serves as a directory for many of the known and active Samvera service providers in the community, and is meant as a starting point. A listing (or the absence of one) does not represent an endorsement or testimony to the nature or quality of the work.  \n\nIf you are a service provider and would like to be listed on this page, please contact the Samvera Community Manager, Heather Greer Klein, heather@samvera.org.\n\n\n### Directory\n\nin alphabetical order\n\n\n* * *\n\n#### CoSector, University of London\n\nThe Research Technologies Team have been hosting and developing OS repositories and associated services since 2007. Working with the EU, Jisc, University College London, The Linnean Society and many more along the way. In recent years we have added Samvera to our expertise stack.\n\nSamvera projects include working with the University of Hull, in partnership with Cottage Labs, to deliver a digital archive for the Hull City of Culture, using Hyrax and Archivematica, and integrating with Blacklight and CALM.\n\nIn June 2018 we launched the [King’s Fund Digital Archive](https://archive.kingsfund.org.uk/). A hosted Hyku repository showcasing digitised archive material The content of this repository was migrated from an existing EPrints instance. The implementation of this repository also included enhancing the Hyku Universal view integration.\n\nSince October 2018 we have been working with the Warburg Institute to set up a Hyrax based offprints repository.\n\nWe are available to provide repository hosting as well as bespoke development of repository features and stand-alone solutions. We can also provide repository-related consultancy, including organisational workflow analysis, needs assessment, upgrade assistance and troubleshooting.\n\n[CoSector](https://www.cosector.com/what-we-do/digital-research), University of London \nContact: [researchtech@cosector.com](mailto:researchtech@cosector.com)\n\n\n* * *\n\n#### Cottage Labs \n[https://cottagelabs.com/](https://cottagelabs.com/)\n\nUK-based but has worked with Partners in the UK and the US.\n\nServices provided:\n\n* software development\n* system maintenance\n* Samvera as a hosted cloud service (“Willow” – coming)\n\nContact: Richard Jones [richard@cottagelabs.com](mailto:richard@cottagelabs.com)\n\n\n* * *\n\n#### Data Curation Experts\n\n[https://curationexperts.com/](https://curationexperts.com/)\n\nUS-based but has worked with Partners in the US and the UK.\n\nServices provided:\n\n* software development\n* system maintenance\n* training\n* Samvera as a hosted cloud service (coming)\n\nContact: Mark Bussey [mark@curationexperts.com](mailto:mark@curationexperts.com)\n\n\n* * *\n\n#### SoftServ by Scientist.com\n\n[http://SoftServ.Scientist.com/](http://softserv.scientist.com/)\n\nFounded as a Rails consultancy in 2007, San Diego-based SoftServ brought their extensive experience in solr and complex devops to the Samvera Community starting in 2016. Formerly known as Notch8, SoftServ became part of Scientist.com in 2021, and continues with the same community-driven work. SoftServ has been an active participant in the development of the Hyku solution bundle, notably through projects with the PALNI and PALCI library consortia and the British Library.  However, their projects have run the breadth of Samvera and related Blacklight implementations, including major Hyrax implementations for Rutgers University and Atla.\n\nA partial list of SoftServ Samvera clients includes:\n\nAtla Digital Library\n\nBritish Library\n\nGBH\n\nGeorgetown University\n\nIndiana University\n\nPALNI & PALCI Hyku for Consortia\n\nRutgers University\n\nUniversity of Tennessee Knoxville\n\nUS Department of Transportation\n\nSoftServ is a Samvera Partner, and we are passionate participants in this community. Our services include full application development; devops support; hosting, maintenance, and support packages; Rails upgrades; and specialized contracts for Samvera consulting.\n\nContact: Kevin Kochanski [softserv@scientist.com](mailto:softserv@scientist.com)\n\n* * *\n\n#### Ubiquity\n\n[https://www.ubiquitypress.com/](https://www.ubiquitypress.com/)\n\nUbiquity is a provider of open publishing services and infrastructure to libraries and institutions.\n\n[Ubiquity repositories](https://ubiquity.pub/repositories/) are based on Samvera Hyku and are professionally supported, cloud hosted and open source, with no lock-in. Suitable for both large and small institutions, they provide high-quality hosting of publications, special collections, theses, Open Educational Resources and research data all in one place. Ubiquity provides full support for migration from existing repositories.\n\nAn example of a multi-tenant installation of the platform is the [Shared Research Repository ](https://iro.bl.uk/)hosted for the British Library. Ubiquity is also actively engaged in further enhancing the Hyku platform with the [Advancing Hyku](https://advancinghyku.io/) project.\n\nContact: Brian Hole [brian.hole@ubiquitypress.com](mailto:brian.hole@ubiquitypress.com)\n","frontmatter":{"title":"Samvera Service Providers","date":"2023-05-26"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Samvera Service Providers - The Community - Samvera","og:title":"Samvera Service Providers - The Community - Samvera","og:type":"website","og:url":"https://samvera.org/the-community/service-providers"},"slug":"service-providers"},"__N_SSG":true}