{"pageProps":{"blogPost":null,"markdownContent":{"content":"\n### [Submit a proposal](https://forms.gle/k47vf7AjVtYUt74M7)\n\nPlease submit your proposals by April 8, 2022\n\nWe are pleased to open the call for presentation proposals for Samvera Virtual Connect 2022! **Samvera Virtual Connect will be held May 4-5, 2022, from 11AM - 2PM Eastern time.**\n\nSamvera Virtual Connect provides the Samvera Community with a free, informal opportunity to share the work occurring in our institutions and via our collaborative efforts.  Virtual Connect occurs entirely online via Zoom webinar to a live audience across the globe, with presentations recorded for asynchronous viewing.\n\nWe’re looking for submissions from across the entire Samvera landscape, including both local development and community work. \n\nThis year’s Virtual Connect will have two days of programming, during which we’ll be coordinating presentations into thematic blocks based on topic, audience, and time.\n\nTo submit a proposal, please prepare the following:  \n\n- Title\n- Abstract\n- Description of Intended Audience\n- Format (20 minute presentation, lightning talk < 10 minutes)\n- Date preference/availability\n","frontmatter":{"title":"Call for Proposals for Samvera Virtual Connect 2022","date":"2022-03-15","categories":["events"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Call for Proposals for Samvera Virtual Connect 2022 - News and Events - Samvera","og:title":"Call for Proposals for Samvera Virtual Connect 2022 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/call-for-proposals-for-samvera-virtual-connect-2022"}},"__N_SSG":true}