{"pageProps":{"blogPost":null,"markdownContent":{"content":"\n\\[English version below\\]\n\nEstamos encantados de anunciar que Duoc UC ([http://www.duoc.cl](http://www.duoc.cl/)), en Santiago de Chile, se ha convertido en el más reciente Hydra Socio formales, y nuestro primer socio en América Latina. Duoc ha estado trabajando con Hydra para construir la “Biblioteca Digital Patrimonial” ([http://loncofilu.cl](http://loncofilu.cl/)), un repositorio digital de planos arquitectónicos, fotografías, planes de restauración y documentos históricos relacionados con los edificios históricos más preciados de Chile, y que representa el trabajo producido por los estudiantes de la Escuela de Construcción Duoc UC. Para el 2015 están planeando el desarrollo de dos repositorios adicionales basados Hydra que se centrarán en la recogida de proyectos de títulos  de estudiantes y de audio y producciones visuales de la Escuela de Comunicación.\n\nEn su carta de intención, Duoc dice que se han comprometido no sólo a la construcción de más proyectos con Hydra, sino también para la construcción de una comunidad de Hydra en América Latina mediante la traducción de la documentación en talleres españoles y explicaciones por otras instituciones de América Latina interesados en la construcción de repositorios de Hydra.\n\nBienvenidos, Duoc UC!\n\nWe are delighted to announce that Duoc UC ([http://www.duoc.cl](http://www.duoc.cl/)), in Santiago, Chile, has become the latest formal Hydra partner, and our first partner institution in Latin America. Duoc has been working with Hydra to build the “Heritage Digital Library” ([http://loncofilu.cl](http://loncofilu.cl/)), a digital repository of architectural drawings, photographs, restoration plans and historical documents related to the most precious historic buildings in Chile, and representing work produced by the students of Duoc’s Faculty of Construction. In 2015 they are planning to develop two additional repositories based on Hydra that will focus on the collection of student thesis projects and audio and visual productions from their Faculty of Communication.\n\nIn their letter of intent, Duoc says they are committed not only to building more projects with Hydra, but also to building a Hydra community in Latin America through the translation of documentation into Spanish and offering workshops to other Latin American institutions interested in building Hydra repositories.\n\nWelcome, Duoc UC!\n","frontmatter":{"title":"Duoc UC, Chile, becomes a Hydra Partner","date":"2015-01-13","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Duoc UC, Chile, becomes a Hydra Partner - News and Events - Samvera","og:title":"Duoc UC, Chile, becomes a Hydra Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/duoc-uc-chile-becomes-a-hydra-partner"}},"__N_SSG":true}