{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nAs you know detailed planning is now underway for an exciting program at Hydra Connect 2015 in Minneapolis this Fall. This post is a quick reminder for those of you who may still want to contribute program ideas; we especially welcome further ideas for items of particular interest to managers or to SysOps. Our thanks to the many people who have already contributed.\n\nThe program committee would love to hear from those of you who have suggestions for items that should be included. These might be workshops or demonstrations for the Monday, or they might be for 5, 10 or 20 minute presentations, discussion groups or another format you’d like to suggest during the conference proper. It may be that you will offer to facilitate or present the item yourself or it may be that you’d like the committee to commission the slot from someone else – you could maybe suggest a name. As in the past, we shall be attempting to serve the needs of attendees from a wide range of experience and background (potential adopters, new adopters, “old hands”; developers, managers, sysops etc) and, if it isn’t obvious, it may be helpful if you tell us who would be the target audience. Those of you going to Open Repositories 2015 might take the opportunity to talk to others about the possibility of joint workshops, presentations, etc.?\n\nPlease let us have your ideas, preferably before Monday 15th June, at [hydra-connect@googlegroups.com](mailto:hydra-connect@googlegroups.com) or by adding them to the page at [HC2015 suggestions for the program](https://wiki.duraspace.org/display/hydra/HC2015+suggestions+for+the+program).\n\nAdvance warning that, as in past years, we shall ask all attendees who are working with Hydra to bring a poster for the popular “poster show and tell” session. This is a great opportunity to share with colleague Hydranauts what your institution is doing and to forge connections around the work. Details later…\n\nFYI: we plan on opening booking in the next few days and we hope to see you in Minneapolis for what promises to be another great Hydra Connect meeting!\n\nBest\n\nPeter Binkley, Matt Critchlow, Karen Estlund, Erin Fahy and Anna Headley (the Hydra Connect 2015 Program Committee)\n","frontmatter":{"title":"Hydra Connect 2015 – 21-24 September, Minneapolis: Request for Program Suggestions :: Reminder!","date":"2015-06-04","categories":["events"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Hydra Connect 2015 – 21-24 September, Minneapolis: Request for Program Suggestions :: Reminder! - News and Events - Samvera","og:title":"Hydra Connect 2015 – 21-24 September, Minneapolis: Request for Program Suggestions :: Reminder! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/hydra-connect-2015-21-24-september-minneapolis-request-for-program-suggestions-reminder"}},"__N_SSG":true}