{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nHydra Partners Indiana University and WGBH Boston have jointly been awarded nearly $400,000 by the National Endowment for the Humanities to develop HydraDAM2, a Hydra-based software tool that will assist in the long-term preservation of audio and video collections.\n\nHydraDAM2 will primarily address challenges posed by long-term preservation of digital audio and video files. Because these “time-based media” files are significantly larger than many other digital files managed by libraries and archives, they potentially require special solutions and workflows.\n\nAn important feature of HydraDAM2 is that it will be open source and can be used and shared freely among cultural institutions, including libraries, archives, universities and public broadcasters.\n\nHydraDAM2 is also scalable to both small and large organizations, having the ability to interact with massive digital storage systems as well as with smaller digital tape storage systems.\n\nThe full press release can be found at http://news.indiana.edu/releases/iu/2014/12/neh-grants-digital-preservation.shtml\n\nCongratulations to Jon Dunn at IU, Karen Cariani at WGBH and to their teams.\n","frontmatter":{"title":"Indiana University and WGBH Boston share major NEH grant","date":"2015-01-08","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Indiana University and WGBH Boston share major NEH grant - News and Events - Samvera","og:title":"Indiana University and WGBH Boston share major NEH grant - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/indiana-university-and-wgbh-boston-share-major-neh-grant"}},"__N_SSG":true}