{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nOrganizations active in the Samvera Community can become [Samvera Partners](https://samvera.atlassian.net/wiki/spaces/samvera/pages/1872461833/About+Samvera+Partners), and make a commitment to support the Community through participation and annual dues. Get to know one of our founding Partners, University of Hull.\n\n_**How long has University of Hull been involved in the Samvera Community?**_\n\nThe University of Hull was one of the founder institutions of the Hydra Project in 2008 (which became Samvera in 2017), following initial discussions at the Open Repositories conference that year.  The original basis for the initiative was to identify a way of creating flexible repository solutions that met different digital content management needs, an emerging theme from the conference.\n\n_**Which Samvera technologies do you use?**_\n\nWe initially created a local Hydra repository based on the initial collection of gems developed in 2012.  This was upgraded to version 6 of this set in 2015.  That repository remains in production, but with a target to migrate collections to different solutions in 2022-3.  One of these solutions will be a Hyrax repository that has been established to manage a digital archive, which we are looking to expand use of to accommodate other content types.\n\n_**Tell us a bit about your repositories. How have you customized them to meet your specific needs?**_\n\nThe initial repositories were built fairly much as vanilla implementations of the available software.  There were, though, three areas where we did add local customisation: the management of permissions, to adapt the repository to our local infrastructure and how we needed different colleagues to have different access rights; the development of admin and display sets to help us manage collections; and the look and feel of the repository and its workflows.\n\nThe newer Hyrax repository has not been adapted per se, other than to integrate it into a digital preservation workflow that creates archival DIPs that act as the basis for ingest to the repository.  We are also not using the default Blacklight interface, but feeding content into a standalone Blacklight that acts as the local archival catalogue.\n\n_**What is your favorite feature of your repository?**_\n\nThis has to be the ability to hold and surface different types of digital content alongside each other.  This has been a goal for the Community for many years and the solutions for it have shown steady evolution to improve the functionality in this area.\n\n_**How do individuals at your organization participate in the Samvera Community?**_\n\nWe have endeavoured to attend events in the US as much as possible and as budget permits.  Individuals have contributed to different working and interest groups over the years.  Being located in the UK, we have also established and maintain the Samvera Europe user group to foster exchange of experiences and developments in a UK/European context.\n\n_**What value does Hull receive from participating in the Samvera Community?**_\n\nWe have gained immense value from participation in the Community, which has helped us to develop our ideas for what we want and need from a repository, provided support in the ability to implement those ideas, and the space to explore different options with fellow professionals working in the same field.\n","frontmatter":{"title":"Samvera Partner Profile: University of Hull","date":"2022-06-13","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Samvera Partner Profile: University of Hull - News and Events - Samvera","og:title":"Samvera Partner Profile: University of Hull - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/samvera-partner-profile-university-of-hull"}},"__N_SSG":true}