{"pageProps":{"content":"\nOf interest to many in the Hydra Community:\n\nWe are pleased to announce that registration is now open for the 10th International Conference on Open Repositories, to be held on June 8-11, 2015 in Indianapolis, Indiana, United States of America. Full registration details and a link to the registration form may be found at: [http://www.or2015.net/registration](http://www.or2015.net/registration)\n\nOR2015 is co-hosted by Indiana University Bloomington Libraries, University of Illinois at Urbana-Champaign Library, and Virginia Tech Libraries.\n\n**OR2015 Registration and Fees:**\n\nAn early registration fee of $450 USD will be available until May 8. After May 8, the registration fee will increase to $500 USD. This registration fee covers participation in general conference sessions, workshops, and interest group sessions, as well as the conference dinner on Wednesday, June 10 and poster reception on Tuesday, June 9. For a draft outline of the conference schedule, please see: [http://www.or2015.net/program/schedule-at-a-glance](http://www.or2015.net/program/schedule-at-a-glance)\n\nParticipants may register online at: [http://www.or2015.net/registration](http://www.or2015.net/registration). If you have any questions about registering for OR2015, please contact the Conference Registrar at [iuconfs@indiana.edu](mailto:iuconfs@indiana.edu). Any other questions about the conference may be directed to the conference organizing committee by using the form at:[http://www.or2015.net/contact-us](http://www.or2015.net/contact-us)\n\n**Hotel Reservations:**\n\nThe OR2015 conference will take place at the Hyatt Regency Indianapolis hotel, conveniently located in the heart of downtown Indianapolis. Special room rates at the Hyatt starting at $159 USD per night have been negotiated for conference attendees and will be available for booking through May 16. More information on hotel reservations and travel is available at:[http://www.or2015.net/conference-hotel-and-travel](http://www.or2015.net/conference-hotel-and-travel)\n\n**Keynote and Featured Speakers:**\n\nReflecting the significant milestone of the 10th Open Repositories conference and this year’s theme of “Looking Back, Moving Forward: Open Repositories at the Crossroads,” we are pleased to announce the conference’s two plenary speakers:\n\nKaitlin Thaney will be giving the opening keynote talk on the morning of Tuesday, June 9. Kaitlin is director of the Mozilla Science Lab, an open science initiative of the Mozilla Foundation focused on innovation, best practice and skills training for research. Prior to Mozilla, she served as the Manager of External Partnerships at Digital Science, a technology company that works to make research more efficient through better use of technology. Kaitlin also advises the UK government on infrastructure for data intensive science and business, serves as a Director for DataKind UK, and is the founding co-chair for the Strata Conference series in London on big data. Prior to Mozilla and Digitial Science, Kaitlin managed the science program at Creative Commons, worked with MIT and Microsoft, and wrote for the Boston Globe. You can learn more about the Science Lab at [http://mozillascience.org](http://mozillascience.org/)  and follow Kaitlin online at @kaythaney.\n\nAnurag Acharya will be the featured speaker at the plenary session on the morning of Wednesday, June 10, presenting on “Indexing repositories: pitfalls and best practices.” Anurag is a Distinguished Engineer at Google and creator of Google Scholar, and he previously led the indexing group at Google. He has a Bachelors in Computer Science from the Indian Institute of Technology, Kharagpur and a PhD in Computer Science from Carnegie Mellon. Prior to joining Google, he was a post-doctoral researcher at the University of Maryland, College Park and an assistant professor at the University of California, Santa Barbara.\n\nWe look forward to seeing you at OR2015!\n\n_Jon Dunn, Julie Speer, and Sarah Shreeves_ _OR2015 Conference Organizing Committee_\n\n_Holly Mercer, William Nixon, and Imma Subirats_ _OR2015 Program Co-Chairs_\n","frontmatter":{"title":"OR2015 NEWS: Registration Opens; Speakers from Mozilla and Google Announced","date":"2015-03-16","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"OR2015 NEWS: Registration Opens; Speakers from Mozilla and Google Announced - News and Events - Samvera","og:title":"OR2015 NEWS: Registration Opens; Speakers from Mozilla and Google Announced - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/or2015-news-registration-opens-speakers-from-mozilla-and-google-announced"}},"__N_SSG":true}