{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are delighted to announce Hydra's latest formal Partner, the Digital Repository of Ireland (DRI).  DRI is Ireland’s national trusted digital repository for Humanities, Social Sciences and Cultural data. The repository links together and preserves both historical and contemporary data held by Irish institutions, providing a central internet access point and interactive multimedia tools. As a national e-infrastructure for the future of education and research in the humanities and social sciences, DRI is available for use by the public, students and scholars.\n\nDRI Director, Natalie Harrower, said: “While DRI has been involved and welcomed in the HydraSphere for many years now, we feel that the time is right to ‘step up’ and become Hydra Partners. We look forward to contributing more to the community and to helping Hydra grow in Europe and further afield.”\n\nDRI became a partner at the end of 2016 but, for some reason, whilst we announced the fact on our mailing lists we failed to do so on this blog.  Our sincere apologies to the team at DRI for the omission.\n","frontmatter":{"title":"The Digital Repository of Ireland joins Hydra","date":"2017-03-04","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"The Digital Repository of Ireland joins Hydra - News and Events - Samvera","og:title":"The Digital Repository of Ireland joins Hydra - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/digital-repository-ireland-joins-hydra"}},"__N_SSG":true}