{"pageProps":{"content":"\nFollowing on from the very successful event in San Diego earlier this year, we are delighted to announce that the second Hydra Connect meeting will take place from Tuesday 30 September to Friday 3 October, 2014.  This is in line with the requests from many attendees at Connect #1 that these meetings should be held in the Fall.\n\nThe meeting will take place at Case Western Reserve University in Cleveland, Ohio.  As before, the Tuesday will be a day of workshops whilst the main meeting from Wednesday to Friday will be a mixture of plenary and breakout sessions.\n\nWe anticipate sending out further details (including booking procedures for the conference itself and for hotels) in mid/late June.  In the meantime, save the dates in your diary!  There are preliminary details on the Hydra wiki at: [Hydra Connect 2 – Fall 2014](https://wiki.duraspace.org/display/hydra/Hydra+Connect+2+-+Fall+2014) and we shall keep that page updated as the event gets closer.\n\nAs we’ve said before:  “as a Hydra Partner or user, if you can only make it to one Hydra meeting in an academic year, _this is the one to attend!”_\n","frontmatter":{"title":"Save the dates for Hydra Connect #2 in the Fall","date":"2014-03-24","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Save the dates for Hydra Connect #2 in the Fall - News and Events - Samvera","og:title":"Save the dates for Hydra Connect #2 in the Fall - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/save-the-dates-for-hydra-connect-2-in-the-fall"}},"__N_SSG":true}