{"pageProps":{"content":"[**What is Samvera?**](#what-is-samvera)\n\n[**Why use Samvera?**](#why-use-samvera)\n\n[**Who uses Samvera, and what for?**](#who-uses-samvera-and-what-for)\n\n[**How is the Samvera Community governed?**](#how-is-the-samvera-community-governed)\n\n[**What do you mean when you say you are part of a community?  How does that work?**](#what-do-you-mean-when-you-say-you-are-part-of-a-community-how-does-that-work)\n\n[**How can I connect with the Samvera Community and stay up to date on events and developments?**](#how-can-i-connect-with-the-samvera-community-and-stay-up-to-date-on-events-and-developments)\n\n[**What is the purpose of Samvera Connect and other in-person meetings of the Samvera Community?**](#what-is-the-purpose-of-samvera-connect-and-other-in-person-meetings-of-the-samvera-community)\n\n[**How do you ensure that everyone can participate in the Samvera Community?**](#how-do-you-ensure-that-everyone-can-participate-in-the-samvera-community)\n\n[**Where can I download and try Samvera?**](#where-can-i-download-and-try-samvera)\n\n[**Why did Samvera choose the specific components that Samvera repository solutions are based on?**](#why-did-samvera-choose-the-specific-components-that-samvera-repository-solutions-are-based-on)\n\n[**What does it cost to implement Samvera?**](#what-does-it-cost-to-implement-samvera)\n\n[**I have developed code that could be of use to Samvera.  How can I share this with others?**](#i-have-developed-code-that-could-be-of-use-to-samvera-how-can-i-share-this-with-others)\n\n[**How do we know Samvera will be around in 5 or 10 years?**](#how-do-we-know-samvera-will-be-around-in-5-or-10-years)\n\n[**Is there an exit strategy for me when I need to move to a different technology?**](#is-there-an-exit-strategy-for-me-when-i-need-to-move-to-a-different-technology)\n\n[**I have heard the terms Hydra, Hyrax, Hyku, and HyBox associated with Samvera-what do they all mean?**](#i-have-heard-the-terms-hydra-hyrax-hyku-and-hybox-associated-with-samvera-what-do-they-all-mean)\n\n[**My institution is moving more and more into the cloud.  Can I have Samvera in the cloud?**](#my-institution-is-moving-more-and-more-into-the-cloud-can-i-have-samvera-in-the-cloud)\n\n[**What does Samvera offer that DSpace, EPrints, ContentDM, Islandora, etc. do not? What makes the Samvera approach to repositories stand out?**](#what-does-samvera-offer-that-dspace-eprints-contentdm-islandora-etc-do-not-what-makes-the-samvera-approach-to-repositories-stand-out)\n\n---\n\n# What is Samvera?\n\nThe name Samvera is an Icelandic term meaning \"togetherness.\"  Samvera is a grass-roots, open-source community of library professionals, including repository managers, developers, metadata experts, content owners and users, working together to create best-in-class digital repository solutions.  The scope of the community encompasses work for Libraries, Archives, Museums and others. Read more about the [Samvera Community Framework](http://samvera.org/samvera-partners/community-framework/) on our website.\n\nSamvera software is free and open source, available under an Apache 2 license.  It offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.  Samvera is based around a framework that combines four major components:\n\n- the [Fedora repository software](http://fedorarepository.org/) providing a robust, durable digital repository layer for persisting and managing digital objects.\n- [Solr indexes](http://lucene.apache.org/solr/), providing fast access to information about an institution’s resources.\n- [Blacklight](http://projectblacklight.org/), a discovery interface that sits above Solr and provides faceted searching, browsing and tailored views on objects.\n- [Samvera gems](https://github.com/samvera), a series of components built using the Ruby on Rails programming language that integrate the building blocks to form the basis of complete, flexible and extensible digital repository solutions.\n\nThe combination of the components is consciously modular to enable individual solutions to make use of alternatives if they so wish. The Samvera community has worked together to develop and sustain a number of “solution bundles” — applications designed to solve a common need in a generalized yet customizable way with minimal development effort required — including the Avalon Media System, for managing and providing access to large collections of digital audio and video, and Hyrax, a front-end enabling common digital collections management and institutional repository features including creation of repository object types on demand, deposit of content via multiple configurable workflows, and description of content with flexible metadata.\n\n---\n\n# Why use Samvera?\n\nWe believe that no single repository system can provide the full range of repository-based solutions for a given institution’s needs; likewise, no single institution can resource the development of a full range of solutions on its own.  Samvera is an open-source repository solution built collaboratively to address a broad range of repository needs. Rather than being one-size-fits-all, Samvera leverages an ecosystem of components that lets institutions assemble and deploy robust and durable repository applications that are tailored to their users' needs and workflows.\n\nDrawing on hard lessons learned in the past about developing software locally rather than working with others, the Samvera Community ensures that multiple hands are in play to keep the software growing and improving.  While many systems offer specific abilities to deposit, manage, deliver or preserve digital content, the Samvera Community looks to provide effective combination of these tasks to enable flexible, extensible solutions that can contribute to a wider content management and preservation environment.  Managing digital collections in this way provides the content with its context and value over time and reduces the work and cost of maintaining it. We could create our own individual stand-alone systems, but we'd be doing them by ourselves. The expense of maintaining something custom in the long-run, would, we believe, outstrip the costs of participating in the Samvera Community effort.\n\nAs a grass-roots, open-source software producer, the Samvera Community is accountable only to its users, which ensures its sustainability.  This is in part a response to concerns raised about commercial software producers, which are liable to alter or even eliminate products based on profitability rather than the values of the cultural heritage and research communities.\n\n---\n\n# Who uses Samvera, and what for?\n\nRead about [implementations of Samvera](https://samvera.atlassian.net/wiki/spaces/samvera/pages/422319621/Samvera+Implementations+In-production) on our wiki.  At a host of educational and cultural institutions, Samvera is currently in use to:\n\n- Provide a digital repository framework for digitized archival collections and faculty publications (see [Case Studies](http://samvera.org/samvera-flexible-extensible/case-studies/))\n- Provide a platform for scholarly communication through initiatives like [Fulcrum](https://www.fulcrum.org/) and [Ubiquity Press](https://www.ubiquitypress.com/)\n- Provide a framework for the management and access of media collections, research data, and geo-referenced data\n\nFor more details about Samvera use cases and links out to current Samvera applications, visit [our Applications & Demos](http://samvera.org/samvera-open-source-repository-framework/applications-demos/) page.\n\n---\n\n# How is the Samvera Community governed?\n\nSamvera is a community, and, as such, it is governed by members of the community.  The [Samvera Partners](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405210590/Samvera+Community+Framework) are at the heart of how Samvera operates.  They encompass groups that coordinate effort across multiple institutions and development efforts. These include the Board, the Roadmap Alignment Group and the Component Maintenance Group, as well as project-specific teams that focus on particular efforts such as the Avalon Media System, Hyrax, and Hyku solution bundles.\n\nThe Samvera Board is an elected body of nine members of the Samvera Partners, with three members cycling off and on each year.  The Board takes on responsibility for the organizational aspects of the Samvera Community, including legal and financial management, and development of internal Community policies.\n\nAll technical work is carried out according to the [Samvera Community Principles](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211354/Samvera+Community+Principles).\n\n---\n\n# What do you mean when you say you are part of a community?  How does that work?\n\nThe people involved in developing ideas and software within the Samvera Community are also those using the solutions created. They thus have a close understanding of the needs. Participation in the Samvera Community is invited at different levels: organizations can join as Partners or Adopters.  Partners take a more active and formal role in the development of Samvera, but all are welcome to contribute as they can. Contributing to the community can take many forms: developing the codebase, developing metadata, contributing to documentation and marketing efforts, or simply adopting the Samvera technology and communicating about that experience.  The Samvera Community has multiple open [Interest and Working Groups](https://samvera.atlassian.net/wiki/spaces/samvera/pages/422319284/Interest+Group+IG+and+Working+Group+WG+Hub) managing the community itself and contributing at various levels to the development of its outputs. Work is managed in concert with other users to ensure that the Samvera technology meets as many shared needs as possible.\n\nContributing to the community is not a one-way street—what we invest in terms of staff time and resources we also take out, in terms of the combined work of the community on a shared set of repository solutions meeting ever more complex needs.\n\n---\n\n# How can I connect with the Samvera Community and stay up to date on events and developments?\n\nThere are several ways to connect with the Samvera Community, and you can find them all on our [Getting Started wiki page](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211682/Getting+Started+in+the+Samvera+Community).  Newcomers to the community are encouraged to join the [Samvera Community Google Group](https://groups.google.com/g/samvera-community) and participate in Samvera on Slack.  Samvera Partner institutions are encouraged to join the [Samvera Partners Google Group](https://groups.google.com/g/samvera-partners). Samvera channels on Slack are open for anyone to follow.  Slack #general covers issues pertinent to the community at large, whilst for developers there is Slack #dev.  There is also a specific channel for those interested in attending our annual Samvera Connect conference, Slack #connect.  The [Samvera wiki](https://samvera.atlassian.net/wiki/spaces/samvera/overview?mode=global) provides a lot of additional detailed information on Samvera Community activity and its '[Get in touch!](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211682/Get+in+touch)' page contains a fuller list of our communication channels .\n\n---\n\n# What is the purpose of Samvera Connect and other in-person meetings of the Samvera Community?\n\nFace-to-face community events maximize the value of participation in Samvera by providing opportunities for Adopters to share local efforts and benefit from the vast experience and expertise of others in shared knowledge and practice.  In-person community events are staff development, training, and networking opportunities all rolled into one. By investing in staff attendance at Samvera Connect and other meetings, an organization can be assured that staff members are supported to learn skills and gain expertise that directly impacts the development and delivery of their Samvera-based repository.  We really do go further together.\n\n---\n\n# How do you ensure that everyone can participate in the Samvera Community?\n\nThe Samvera Community takes the inclusion of everyone who wishes to participate very seriously.  A [Code of Conduct](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405212316/Code+of+Conduct) and [Anti-Harassment Policy](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211680/Anti-Harassment+Policy) has been published, and a community group of [Samvera Helpers](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211681/Samvera+Community+Helpers) provides an email address and individual contact points where any behavior that is not in keeping with Samvera’s principles can be flagged for attention and action.  This approach is applied within both the physical and virtual channels through which community members interact.\n\nThe continuing need to find ways of enabling under-represented groups within our wider sector to participate in Samvera’s work is an ongoing responsibility of the Samvera Partners.\n\n---\n\n# Where can I download and try Samvera?\n\nAll the software is available through the Samvera Community's [Github](https://github.com/samvera).  Documentation is available at [http://samvera.github.io/](http://samvera.github.io/).  A test instance of the Hyrax implementation of the Samvera framework is made available by Data Curation Experts (DCE) at [https://nurax.curationexperts.com/](https://nurax.curationexperts.com/).\n\n---\n\n# Why did Samvera choose the specific components that Samvera repository solutions are based on?\n\nThe components that form the basis of Samvera’s solutions (Fedora, Blacklight, Solr) were selected as well-designed services in their own right, and in recognition of their successful use in existing services.  Samvera has created associated components (Samvera gems) to bring them together in ways that make them more than the sum of their parts.\n\nThe Samvera architecture was always designed to allow for individual components to be replaced with new or preferred technologies.  For example, the Valkyrie initiative is designing a means through which alternatives to Fedora can be used if desired.\n\n---\n\n# What does it cost to implement Samvera?\n\nSamvera software is free and open-source, but of course, this is free in the same way that stray puppies come free: you will have your own ongoing support and maintenance costs to look after it.  Depending on the complexity and degree of local customization you require in your implementation, areas of cost to your institution may include:\n\n- Staff time in development, repository management, and digital infrastructure\n- Outsourcing of development, hosting, and support\n- Staff contributions to the Samvera Community in the way of participating in Samvera Working Groups and attending Samvera Connect\n\nMost adopting institutions have a minimum of one developer, one metadata librarian, and one manager investing significant time in the Samvera instance.\n\nDevoting resources to development using Ruby on Rails is a requirement, whether that be provided in-house or through one of the [service providers](http://samvera.org/communication/service-providers/) that support Samvera, in order to capitalise on the flexibility that Samvera offers.\n\nImplementing Samvera represents a valuable investment in the durability of your digital collections, and this comes with a commitment to the work involved in building the solution that’s right for you.\n\nImplementing Samvera is also an important investment in the future of sustainable, values-driven, open-source technology for scholarly communication and cultural heritage.  Learn more about [getting started with Samvera](http://samvera.org/communication/getting-started/) on our website.  Follow [News & Events](http://samvera.org/news-events/) to keep in the loop about learning and training opportunities.\n\n---\n\n# I have developed code that could be of use to Samvera.  How can I share this with others?\n\nFirstly, thank you for considering sharing your work with Samvera, it’s very much appreciated.  There is guidance on making technical contributions to Samvera available on our [Documentation](https://samvera.github.io/tag_community.html) site.  Please also note that we require all contributions to be licensed via a completed [Contributor Licensing Agreement](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211651/Samvera+Community+Intellectual+Property+Licensing+and+Ownership) to ensure clarity in how Samvera can continue to make use of code you created.\n\n---\n\n# How do we know Samvera will be around in 5 or 10 years?\n\nSamvera leverages the convening power of institutions, which outlasts the ebb and flow of vendor cycles. Since the founding of the Samvera Community in 2008, Partner institutions have made substantial investments, both financially and in terms of staff time, in the Samvera Community and technologies.  There are now over thirty Partners who have contributed to sustainability-minded investments including funding to enable the hiring of a Community Manager; moving to a 501(c)6 foundation model; and moving to a fully elected Board.\n\nThese investments, in addition to the steadily growing number of Samvera Adopters, testify to the durability of Samvera as an avenue toward the future of accessible, open-access scholarly communications and digital preservation of our cultural heritage. The goal of the Samvera community is to be a more sustainable long-term solution than commercial options.\n\n---\n\n# Is there an exit strategy for me when I need to move to a different technology?\n\nWe know that nothing lasts forever and that some of our community will probably wish to move on to other, non-Samvera solutions in time.  In keeping with Samvera’s use of open source components, it is important that the content being managed should be openly transferable to facilitate its management over time regardless of the software being used.  To support this Samvera is developing bulk import and export capability: the latter will allow the contents of a Samvera repository to be exported in a way that might be migrated to other platforms.\n\n---\n\n# I have heard the terms Hydra, Hyrax, Hyku, and HyBox associated with Samvera what do they all mean?\n\nSamvera started as the Hydra Project in 2008, and changed to its current name in 2017: this change was community-led and based on a vote taken among members of the Community.  For a history of the development of Samvera from its Hydra roots, see the [article published in Insights](https://insights.uksg.org/articles/10.1629/uksg.383/) in November 2017.\n\nHyrax utilizes the Samvera framework to provide Adopters and Partners with a base-level institutional repository (IR) solution that can be customized.  Hyrax combines the best parts from individual implementations of Samvera software into a common solution. It continues to evolve as new ideas and practices emerge from the community and are taken on through the [Hyrax Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/496632287/Hyrax+Interest+Group).\n\nHyku is the product release from the Hydra-in-a-Box (HyBox) project and it is built using Hyrax as its basis.  Hyku is designed to reduce barriers to effective asset management and preservation for collections and content types of many kinds, and is of particular interest to hosted service providers and consortia. The [Hyku Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/419533203/Samvera+Hyku+Interest+Group) has a group of service providers and institutions exploring how Hyku can be utilized to serve a range of repository service needs.\n\n---\n\n# My institution is moving more and more into the cloud.  Can I have Samvera in the cloud?\n\nHyku was created specifically to work in the cloud as a multi-tenanted solution for delivering repository solutions.  Several Samvera repositories are also deployed or partially deployed via Amazon Web Services (AWS). Amazon Machine Images (AMIs), docker storage, and other cloud-friendly technologies are being used to support Samvera deployment and components of Samvera solution bundles.  For example: the [Avalon](http://www.avalonmediasystem.org/project) Media System, an implementation of the Samvera framework focused on media content, is fully deployable in AWS and uses AWS transcoding to create multiple bitrate versions of uploaded content.\n\n---\n\n# What does Samvera offer that DSpace, EPrints, ContentDM, Islandora, etc. do not? What makes the Samvera approach to repositories stand out?\n\nMany repository systems offer useful features to meet repository needs.  As well as offering a proven open-source solution, Samvera comes with an active, engaged community to work with on shared development to improve the technologies and modify them as required to integrate new tools and functions.  Members of the community are always available through the Samvera Slack channels or through our Google Groups and are always willing to answer queries where they can.  Samvera offers flexibility in managing different types of digital assets, including audiovisual and geospatial data. It provides the ability to curate and build exhibits from a single database. And it offers the flexibility to start small and plan to grow, in stages that you can manage in line with your needs and budget.\n\nThe Samvera Community believes that no single system can provide the full range of repository-based solutions for a given institution’s needs and that no single institution can resource the development of a full range of solutions on its own.  On that basis we see value primarily in working together to achieve our goals through the development of shared solutions that can be adapted to meet local needs.\n\nSamvera acknowledges that there are different approaches that can be taken in the application of technologies to create repository solutions.  We welcome the broader sharing of experience in applying technologies in different ways. What can be achieved with developments in technology will continue to evolve, and coming together to share the benefits of these developments will, we believe, continue to serve all involved in curating digital collections.\n","frontmatter":{"title":"FAQ","date":"2016-12-05"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"FAQ - About Samvera - Samvera","og:title":"FAQ - About Samvera - Samvera","og:type":"website","og:url":"https://samvera.org/about/faq"},"sideNav":[{"date":"2022-04-05","slug":"samvera-2021-annual-report","title":"Annual Report"},{"date":"2021-08-04","slug":"samvera-code-of-conduct-and-anti-harassment-policy","title":"Samvera Code of Conduct and Anti-Harassment Policy"},{"date":"2017-04-11","slug":"interest-working-groups","title":"Interest and Working Groups"},{"date":"2016-12-06","slug":"licensing","title":"Licensing"},{"date":"2016-12-06","slug":"samvera-community-sourced-software","title":"Samvera is Community Sourced Software for Repository Solutions"},{"date":"2016-12-05","slug":"faq","title":"FAQ"},{"date":"2016-10-07","slug":"governance","title":"Governance and Philosophy"},{"date":"2016-10-07","slug":"philosophy","title":"Philosophy"}],"sideNewsAndEvents":[{"date":"2023-03-28","slug":"Samvera-News-March-2023","title":"Samvera News March 2023"},{"date":"2023-03-23","slug":"CFP-Samvera-Virtual-Connect-2023","title":"Call for Proposals: Samvera Virtual Connect 2023"},{"date":"2022-09-08","slug":"2022-Julie-Allinson-Award-Recipient","title":"2022 Julie Allinson Award Recipient"},{"date":"2022-08-01","slug":"Samvera-Partner-Profile-WGBH","title":"Samvera Partner Profile: WGBH"},{"date":"2022-06-15","slug":"call-for-samvera-connect-2022-proposals","title":"Call for Samvera Connect 2022 Proposals"},{"date":"2022-06-13","slug":"samvera-partner-profile-university-of-hull","title":"Samvera Partner Profile: University of Hull"},{"date":"2022-05-19","slug":"samvera-partner-profile-get-to-know-hyku-for-consortia","title":"Samvera Partner Profile: Get to Know Hyku for Consortia"},{"date":"2022-05-16","slug":"announcing-the-release-of-hyku-4-0","title":"Announcing the release of Hyku 4.0"},{"date":"2022-05-11","slug":"samvera-virtual-connect-2022-recordings","title":"Samvera Virtual Connect 2022 recordings"},{"date":"2022-04-25","slug":"program-now-available-for-samvera-virtual-connect-may-4-5-2022","title":"Program now available for Samvera Virtual Connect, May 4-5, 2022"},{"date":"2022-04-06","slug":"call-for-proposals-extended-to-4-15-for-samvera-virtual-connect-2022","title":"Call for Proposals extended to 4/15 for Samvera Virtual Connect 2022"},{"date":"2022-04-05","slug":"samvera-community-2021-annual-report","title":"Samvera Community 2021 Annual Report"},{"date":"2022-03-15","slug":"call-for-proposals-for-samvera-virtual-connect-2022","title":"Call for Proposals for Samvera Virtual Connect 2022"},{"date":"2021-10-04","slug":"see-the-schedule-and-register-for-samvera-connect-2021-online","title":"See the schedule and register for Samvera Connect 2021 Online"},{"date":"2021-09-22","slug":"registration-now-open-for-samvera-connect-2021-online","title":"Registration now open for Samvera Connect 2021 Online"}]},"__N_SSG":true}