{"pageProps":{"content":"\nWe hope that many Hydranauts will wish to attend and contribute to the Open Repositories 2014 conference in Helsinki.  This is the latest call for proposals.\n\n**FOR IMMEDIATE RELEASE** January 9, 2014 Read it online: [http://bit.ly/1ghYi3Q](http://bit.ly/1ghYi3Q)\n\n**GET READY to Submit Your OR2014 Proposal**\n\n_A message from the Open Repositories 2014 Conference organizers_\n\nAs the year turns it’s time to look forward to the [Ninth International Conference on Open Repositories](http://or2014.helsinki.fi/), OR2014 (#or2014). The conference will take place June 9-13 in Helsinki, Finland hosted by University of Helsinki‘s twin libraries: [Helsinki University Library](http://www.helsinki.fi/library/) and the [National Library of Finland](http://www.nationallibrary.fi/).\n\nThe theme this year is “Towards Repository Ecosystems” emphasizing the interconnected nature of repositories, institutions, technologies, data and the people who make it all work together. There are several different formats (see below) provided to encourage your participation in this year’s conference. With the deadline for submissions fast approaching the organizers invite you to review the call for proposals here:[http://or2014.helsinki.fi/?page\\_id=281](http://or2014.helsinki.fi/?page_id=281), and to submit your proposal here:[https://www.conftool.com/or2014](https://www.conftool.com/or2014/)/ by Feb. 3, 2014.\n\nKEY DATES\n\n• 3 February 2014: Deadline for submissions • 4 April 2014: Submitters notified of acceptance to general conference • 17 April 2014: Submitters notified of acceptance to interest groups • 9-13 June 2014: OR2014 conference\n\nSUBMISSION PROCESS\n\n_Conference Papers and Panels_\n\nWe welcome proposals that are at least two pages and no more than four pages in length for presentations or panels that deal with digital repositories and repository services. Abstracts of accepted papers will be made available through the conference’s web site, and later they and associated materials will be made available in a repository intended for current and future OR content. In general, sessions are an hour and a half long with three papers per session; panels may take an entire session. Relevant papers unsuccessful in the main track will automatically be considered for inclusion, as appropriate, as an Interest Group presentation.\n\n_Interest Group Presentations_\n\nOne to two-page proposals for presentations or panels that focus on use of one of the major repository platforms (DSpace, ePrints, Fedora and Invenio) are invited from developers, researchers, repository managers, administrators and practitioners describing novel experiences or developments in the construction and use of repositories involving issues specific to these technical platforms.\n\n_24×7 Presentation Proposals_\n\nWe welcome one- to two-page proposals for 7 minute presentations comprising no more than 24 slides. Similar to Pecha Kuchas or Lightning Talks, these 24×7 presentations will be grouped into blocks based on conference themes, with each block followed by a moderated discussion / question and answer session involving the audience and whole block of presenters. This format will provide conference goers with a fast-paced survey of like work across many institutions, and presenters the chance to disseminate their work in more depth and context than a traditional poster.\n\n_“Repository Rants” 24×7 Block_\n\nOne block of 24×7’s at OR14 will revolve around “repository rants”: brief exposés that challenge the conventional wisdom or practice, and highlight what the repository community is doing that is misguided, or perhaps just missing altogether. The top proposals will be incorporated into a track meant to provoke unconventional approaches to repository services.\n\n_Posters, Demos and Developer “How-To’s”_\n\nWe invite developers, researchers, repository managers, administrators and practitioners to submit one-page proposals for posters, demonstrations, technical how-tos and technology briefings. Posters provide an opportunity to present work that isn’t appropriate for a paper; you’ll have the chance to do a 60-second pitch for your poster or demo during a plenary session at the conference. Developer “How-To’s” will provide a forum for running a mini-tutorial or demonstration in the developer lounge, if there are enough interested parties.\n\n_Developer Challenge_\n\nEach year a significant proportion of the delegates at Open Repositories are software developers who work on repository software or related services, and once again OR2014 will feature a Developer Challenge. An announcement will be made in the future with more details on the Challenge. Developers are also encouraged to make submissions to the other tracks–including posters, demonstrations, and 24×7 presentations–to present on recently completed work and works-in-progress.\n\n_Workshops and Tutorials_\n\nOne- to two-page proposals for Workshops and Tutorials addressing theoretical or practical issues around digital repositories are welcomed. Please address the following in your proposal:\n\n• The subject of the event and what knowledge you intend to convey • Length of session (e.g., 1-hour, 2-hour? half a day? whole day?) • How many attendees you plan to accommodate • Technology and facility requirements • Any other supplies or support required • A brief statement on the learning outcomes from the session • Anything else you believe is pertinent to carrying out the session\n\nSubmit your paper, poster, demo or workshop proposal through the conference system. PDF format is preferred. Please include presentation title, authors’ names and affiliations in the submission. The conference system is now open and  is linked from the conference web site: [http://or2014.helsinki.fi/](http://or2014.helsinki.fi/)\n\nSee you in Helsinki!\n","frontmatter":{"title":"GET READY to Submit Your OR2014 Proposal","date":"2014-01-19","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"GET READY to Submit Your OR2014 Proposal - News and Events - Samvera","og:title":"GET READY to Submit Your OR2014 Proposal - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/get-ready-to-submit-your-or2014-proposal"}},"__N_SSG":true}