{"pageProps":{"content":"\nIf you’re coming to Hydra Connect 2015, please read on carefully.  Planning to come but not booked yet?  Tickets are selling steadily and we have a limit of 200 places – don’t leave your booking too late!  Full details at **[Hydra Connect 2015](https://wiki.duraspace.org/display/hydra/Hydra+Connect+2015)** including lists of the workshops, plenary and parallel track sessions.  Taking account of people who have agreed to speak but have not yet registered, almost half the tickets have gone.\n\nWe are devoting more than two hours of Hydra Connect 2015 to a “poster show and tell” slot.  At previous Connects this proved to be a highly successful session and we were urged to repeat it.  The event is an “open room format”:  each contributor is given a poster display space and table around the outside of a large room.  Attendees are encouraged to circulate and to discuss the work represented in each poster with the author(s).  We encourage authors to time-share with a colleague where possible so that everyone gets the chance to circulate.\n\nWe are asking all institutions represented at Hydra Connect to create a poster (or more) about any significant Hydra-related work they are doing (or planning) and to arrive in Minneapolis prepared to talk about it in the poster show and tell.  We know how awkward it can be to bring posters on a plane so we are making arrangements for you to email it for printing locally.\n\nPosters should be sent either in PowerPoint or PDF format. They should be at either half scale or full scale to prevent issues with images when scaling. The maximum size is 24″ x 36″ (tall or wide) or 36″ x 48″ (wide only).  Anything smaller that that can be printed.  Costs for printing and foam mounting these sizes are approximately $90 and $135 respectively.  We will send details explaining how to use this local service in due course; in the meantime, please get designing!\n\nPeter Binkley, Matt Critchlow, Karen Estlund, Erin Fahy, Anna Headley (Program Committee)\n\nMark Bussey (Conference host)\n","frontmatter":{"title":"Coming to Hydra Connect 2015? We need a poster from you!","date":"2015-07-27","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Coming to Hydra Connect 2015? We need a poster from you! - News and Events - Samvera","og:title":"Coming to Hydra Connect 2015? We need a poster from you! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/coming-to-hydra-connect-2015-we-need-a-poster-from-you"}},"__N_SSG":true}