{"pageProps":{"content":"\nWe are delighted to announce that CoSector at the University of London has become a formal Samvera Partner.  Staff at the University of London have been building and hosting repositories for over 15 years, first as the University of London Computer Centre (ULCC) and more recently as CoSector. In 2016, the team made the decision to develop new repository systems based on Samvera. This is an important part of the expansion of their hosted services, with Samvera offering the sort of flexibility and adaptability that supports new customer requirements for different kinds of repository systems.\n\nCoSector’s decision to work with Samvera was not based on the technology alone, but also on the strong community that supports it. Since joining that community, they have aimed to be active members, through code contributions, participating in working groups, taking part in tech calls and attending events such as Samvera Connect.  Early work with Samvera has seen the CoSector team develop two new software gems relating to Hyrax and Hyku that are freely available. In addition, they have contributed enhancements to the IIIF / Universal Viewer implementations in Hyku and Hyrax and will shortly be working on IIIF Search API support. CoSector are also active in community meetings and discussions, and have joined a number of Working Groups and Interest Groups. For this calendar year they will be hosting the Samvera Europe meetings.\n\nIn 2018 CoSector will begin to more actively promote their Samvera services. They have already seen a lot of interest the systems and have spoken with a number of potential adopters. They are confident that they will bring new members to the community, helping strengthen and develop Samvera in the UK and Europe.\n\nWe look forward to a long and productive working relationship with the CoSector team and we welcome them into Samvera Partnership.\n","frontmatter":{"title":"CoSector at the University of London is the latest Partner","date":"2018-03-19","categories":["news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"CoSector at the University of London is the latest Partner - News and Events - Samvera","og:title":"CoSector at the University of London is the latest Partner - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/cosector-university-london-latest-partner"}},"__N_SSG":true}