{"pageProps":{"content":"\nThe Samvera Connect 2018 (SC18) Salt Lake City hosting committee is excited to announce that [registration](https://umarket.utah.edu/um2/marriottlib/product.php?product=9) for the annual Samvera Connect conference is now open. Samvera Connect 2018 will take place from October 9-12 and is hosted by the University of Utah, J. Willard Marriott Library.\n\nThe overall schedule will remain similar to those of years past, but this year the SC18 conference will begin on Tuesday and finish on Friday. More information on the schedule format can be found on the [Samvera Connect 2018 wiki](https://wiki.duraspace.org/display/samvera/Samvera+Connect+2018)\n\nWe have also created a [Samvera Connect 2018 website](https://connect2018.lib.utah.edu/) that provides helpful information about lodging, transportation, dining, family resources, and additional information about  the University of Utah, Salt Lake City, and Utah to help plan your visit.\n\nAs the saying goes, If you can only make it to one Samvera meeting in 2018, this is the one to attend!\n\nWe look forwarding to seeing everyone at Samvera Connect 2018!\n","frontmatter":{"title":"Registration open for Samvera Connect 2018","date":"2018-06-26","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Registration open for Samvera Connect 2018 - News and Events - Samvera","og:title":"Registration open for Samvera Connect 2018 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/registration-open-samvera-connect-2018"}},"__N_SSG":true}