{"pageProps":{"blogPost":{"title":"Hyku for Consortia transitions from pilot phase to full production","slug":"hyku-for-consortia-full-production","publishDate":"2024-11-26T00:00-05:00","content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"The Partnership for Academic Library Collaboration and Innovation (PALCI) and the Private Academic Library Network of Indiana (PALNI) are proud to announce the successful transition of Hyku for Consortia from pilot phase to full production—now serving 40 libraries across four prominent partners in the ","nodeType":"text"},{"data":{"uri":"https://hykucommons.org/"},"content":[{"data":{},"marks":[],"value":"Hyku Commons","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":": PALCI, PALNI, the Boston Library Consortium (BLC), and the Virtual Library of Virginia (VIVA).  ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This milestone marks a significant achievement for the project, as Hyku for Consortia moves beyond initial testing to provide stable, production-level service supported by a robust, community-driven infrastructure. Additionally, collaborators recently received ","nodeType":"text"},{"data":{"uri":"https://hykuforconsortia.palni.org/news/palni-and-palci-awarded-imls-grant-to-enhance-and-sustain-hyku-open-source-community"},"content":[{"data":{},"marks":[],"value":"another round of funding from the Institute of Museum and Library Services","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":" to enhance and sustain the Hyku open-source community.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"“The transition to production includes rigorous testing of our business model to ensure that Hyku can sustainably meet the needs of consortial libraries,” says Amanda Hurford, PALNI Scholarly Communications Director. “As we continue to refine and adjust this model, our focus remains on creating an open-source, adaptable repository platform that scales efficiently across institutions. Ongoing funding from the Institute of Museum and Library Services (IMLS) is helping fuel this process, ensuring we have the resources to both sustain and enhance Hyku for long-term success.” ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"","nodeType":"text"},{"data":{"uri":"https://hykuforconsortia.palni.org/news/hyku-for-consortia-transitions-from-pilot-phase-to-full-production"},"content":[{"data":{},"marks":[],"value":"Read more about this exciting development on the Hyku for Consortia website.","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"tag":["news","hyku"]},"markdownContent":null,"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Hyku for Consortia transitions from pilot phase to full production - News and Events - Samvera","og:title":"Hyku for Consortia transitions from pilot phase to full production - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/hyku-for-consortia-full-production"}},"__N_SSG":true}