{"pageProps":{"content":"\nWe are delighted to announce that Oregon Digital has joined the Hydra Project.\n\nOregon Digital is a successful partnership between the University of Oregon and Oregon State University working on shared digital collections and infrastructure. Since Oregon Digital’s launch in 2009, they have embraced the idea that innovation through collaboration makes them stronger and allows them to go farther, an ethos echoed through the Hydra Project. Over the last year, they have been working on migrating their shared infrastructure to Hydra and developing tools to make migration easier for not only Oregon but also the broader digital library community.\n\nThe institutions that make up Oregon Digital are experienced with the powerful results of collaboration, innovation, and service. They have committed to contributing to the Hydra Project through evangelism for Hydra and its capabilities and have been active spokespeople, particularly with RDF and for mixed media digital collections. They have also committed to extending their role by contributing code and documentation, leading and participating in working groups, as well as being open to new ways of contributing to the community.\n\nWe welcome both Oregon Digital universities to Hydra and look forward to a long and fruitful collaboration with them.\n\n\\[_Text adapted from Oregon Digital’s “Letter of Intent”_\\]\n","frontmatter":{"title":"Oregon Digital joins Hydra","date":"2014-04-27","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Oregon Digital joins Hydra - News and Events - Samvera","og:title":"Oregon Digital joins Hydra - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/oregon-digital-joins-hydra"}},"__N_SSG":true}