{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nLast week saw two very successful Hydra events in Dublin, Ireland.\n\nThe first event was the Hydra Europe Symposium held on 7/8 April. Some 35 people attended, primarily from the UK and Ireland, but with several delegates from mainland Europe too. The event provided a full introduction to Hydra, stressing how the technology and the community interact to provide a well rounded repository solution. Some very positive feedback has been received and we look forward to doing other similar events elsewhere in the future. The presentations from the event can be found on our [Events, presentations and articles page](https://wiki.duraspace.org/display/hydra/Events%2C+presentations+and+articles \"Events, presentations and publications\") on the wiki.\n\nFollowing on from the symposium, running 8-11 April, was a Hydra Camp where an enthusiastic group of individuals got to grips with Hydra “under the hood”. The [next Hydra Camp is 6-9 May in Minneapolis](http://projecthydra.org/2014/03/10/spring-2014-hydra-camp-minneapolis-mn-may-6-9/ \"next Hydra Camp\") and there are still some places left (as at 19th April).\n\nThanks to our friends at Trinity College, Dublin for providing the facilities and support (and for guiding us to some excellent local hostelries…), and thanks to our speakers and tutors.\n","frontmatter":{"title":"Hydra in Dublin","date":"2014-04-19","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Hydra in Dublin - News and Events - Samvera","og:title":"Hydra in Dublin - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/hydra-in-dublin"}},"__N_SSG":true}