{"pageProps":{"content":"Samvera Connect 2023 is [open for registration](https://samveraconnect2023.sched.com/) and **Early Bird rates are available through September 23rd**. The conference will take place from October 23rd - 26th at the [Philadelphia Marriott Old City](https://www.marriott.com/events/start.mi?id=1689017553914&key=GRP). Samvera Connect is an opportunity for individuals interested in the Samvera Community and related repository technologies to convene, collaborate, and advance the open source community.\n\nSamvera Connect 2023 is set to be a collaborative experience that brings together a diverse range of library and archives professionals, developers, and technologists to learn from each other about the latest trends and innovations in Samvera’s repository technologies. The conference will feature an array of activities including **five pre-conference workshops, a dynamic plenary day, poster reception, and an insightful two-track presentation day.** The conference also offers an optional Developers Congress day, providing developers and technologists a unique chance to join forces and collaborate on Samvera Community feature planning and development projects.\n\nOne highlight of the conference will be the keynote address by Dr. Paul D. Barclay, Professor of History at Lafayette College. Dr. Barclay's presentation will shine a spotlight on the success story of the East Asia Image Collection (EAIC) within the Lafayette Digital Repository, powered by Samvera's Hyrax open source repository software. The talk will underscore the remarkable journey of collaboration between diverse stakeholders – administrators, developers, metadata experts, image-capture specialists, student assistants, donors, and academic historians – that has reimagined, enriched, and evolved the EAIC over the past decade. Dr. Barclay's insights will delve into the practical and intangible benefits of constructing digital repositories.\n\nSituated in the heart of the historic district, the Philadelphia Marriott Old City provides a convenient and exciting location for connecting and learning from one another. Attendees are encouraged to secure their accommodations by booking through the [Samvera Connect group rate link](https://www.marriott.com/events/start.mi?id=1689017553914&key=GRP) by September 22nd. Staying within the conference hotel not only enhances the experience but also contributes to keeping conference costs manageable.\n\nTo learn more and register for Samvera Connect 2023, please visit [https://samveraconnect2023.sched.com/](https://samveraconnect2023.sched.com/). Don't miss out on this opportunity to connect, learn, and help build the future of Samvera’s repository technologies.\n","frontmatter":{"title":"Join Us in Philadelphia for the Samvera Connect 2023 Conference: Shaping the Future of Repository Technologies ","date":"2023-09-20","categories":["news","events"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Join Us in Philadelphia for the Samvera Connect 2023 Conference: Shaping the Future of Repository Technologies  - News and Events - Samvera","og:title":"Join Us in Philadelphia for the Samvera Connect 2023 Conference: Shaping the Future of Repository Technologies  - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/connect-2023-early-bird-rates"}},"__N_SSG":true}