{"pageProps":{"content":"\nAs of Sunday 13th July 2014 we shall be changing the name of the hydra-users mailing list to [hydra-community@googlegroups.com](mailto:hydra-community@googlegroups.com).  The old hydra-users email address will cease to work. This change needs no action on your part unless you have an inbox rule looking for (say) “\\[hydra-users\\]” which will need changing to the new name.  User accounts and permissions will automatically carry forward to the renamed list. That said, you may wish to add the new hydra-community address to your contacts and/or safe senders lists.\n\nThis change is part of a strategy to allow new adopters of Hydra more involvement in the community.  Whilst the hydra-tech list does a good job of keeping developers in touch, the “managers” at adopting institutions which are not Hydra Partners are not so well served.  Once the open (as in “anyone may request to join”) hydra-community list is turned on we shall be encouraging non-technical discussions onto it in preference to the hydra-partners list.  The closed (Partner institutions only) hydra-partners list will be kept for such things as messages around security issues (prior to wider release) and for any Partner issues requiring a vote.\n","frontmatter":{"title":"IMPORTANT change of Hydra email address","date":"2014-07-08","categories":["news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"IMPORTANT change of Hydra email address - News and Events - Samvera","og:title":"IMPORTANT change of Hydra email address - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/important-change-of-hydra-email-address"}},"__N_SSG":true}