{"pageProps":{"content":"\nSamvera Partners are institutions, corporations or other groups that have formally committed to contributing to the Samvera Community. Samvera Partners collectively advance the project and the Community for the benefit of all participants. [Learn more about Partnership on the Samvera wiki.](https://samvera.atlassian.net/wiki/spaces/samvera/pages/1872461833/About+Samvera+Partners)\n\nThe Samvera Partners contribute to groups that coordinate activity from multiple institutions and development efforts. These include the Board of Directors, the Roadmaps Alignment Group, the Core Components Maintenance Group and Samvera’s Interest and Working Groups, as well as teams working on specific projects and solutions such as the Avalon Media System, Hyrax, and Hyku.\n\nPartnership is earned by actively contributing to the Community. Partners:\n\n**Contribute.** Annual Partnership dues to support Community infrastructure along with any one or more of: code, analysis, design, documentation, presentations and other forms of communication, marketing, support, funding, participation in working/interest groups, or other resources.\n\n**Stay Informed.** Additionally, be among the first to be notified of any known security issues and fixes, ahead of the information being made public.\n\n**Meet.** Participate in Samvera Partner meetings and other conversations that shape our future.\n\n**Vote.** As a Partner, it is a duty and privilege to vote on elected positions and on other matters of importance.\n\n**Lead.** Help lead the way by participating in the governance of Samvera. Partners may provide input on the Community and technical direction up to the highest levels, and represent Samvera to the broader community. Partners have the right to nominate persons for election to the Samvera Board of Directors.\n\n<iframe src=\"https://www.google.com/maps/d/u/1/embed?mid=1kLOr2tK3nZyuc49AInv_CtjwF30CzSGT\" width=\"100%\" height=\"600\"></iframe>\n\n","frontmatter":{"title":"Samvera Partners","date":"2016-12-06"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Samvera Partners - The Community - Samvera","og:title":"Samvera Partners - The Community - Samvera","og:type":"website","og:url":"https://samvera.org/the-community/samvera-partners"},"slug":"samvera-partners"},"__N_SSG":true}