{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe’re delighted to announce that registration is now open for Samvera Connect 2019 to be held at Washington University in St Louis 22-25 October.  An early bird price of $265 will apply until 12th September, after which it will be $285.  We shall be able to offer a small number of scholarships, covering registration and hotel costs, and details of these will be released in a few weeks.  Full details of the conference, including the registration details, can be found via its web gateway at [https://connect2019.samvera.org](https://connect2019.samvera.org).\n\nThe CfP for the workshops to be held on 22nd October is now closed and a full list is available [via the website](https://wiki.duraspace.org/display/samvera/Samvera+Connect+2019%3A++Program) or via Sched (sc2019).  The CfP for presentations and panels is open and [details can be found here](https://wiki.duraspace.org/display/samvera/Samvera+Connect+2019%3A+Calls+for+Proposals).  As in the past, our goal is to serve the needs of attendees from an ever-widening range of experience and background (potential adopters, new adopters, expert Samverans; developers, managers, sysops, metadata librarians, etc.).  Please consider what you might propose to help this be another very successful event.\n\nPlease feel free to share this announcement with other interested colleagues and relevant mailing lists.\n","frontmatter":{"title":"Registration is open for Samvera Connect 2019","date":"2019-07-01","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Registration is open for Samvera Connect 2019 - News and Events - Samvera","og:title":"Registration is open for Samvera Connect 2019 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/registration-is-open-for-samvera-connect-2019"}},"__N_SSG":true}