{"pageProps":{"blogPost":null,"markdownContent":{"content":"It is our great pleasure to announce that the recipient of the 2022 Julie Allinson Award is **tamsin johnson from University of California, Santa Barbara.** \n\ntamsin was jointly nominated by Julie Hardesty (Indiana University), Jessica Hilt (University of California, San Diego), and Chrissy Rissmeyer (University of California, Santa Barbara). In their nomination letter, they nominated tamsin for the award “in recognition of their outstanding technical leadership, mentorship, and tireless efforts in addressing and raising awareness about issues of equity, diversity, and inclusion in our community.” \n\nThey also highlighted that tamsin is “generous with their knowledge, always willing to pair with new and existing members of the Samvera Community. They are patient with new contributors, encouraging members to take tickets that are outside their comfort zone with the offer of support and education throughout the process.” \n\nThe letter ends by noting that “the efforts of one person can truly make a difference. Julie Allinson was one such individual and tamsin johnson is as well.”\n\nCongratulations tamsin, and thank you for your outstanding and continuing contributions to the Samvera Community!\n","frontmatter":{"title":"2022 Julie Allinson Award Recipient","date":"2022-09-08","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"2022 Julie Allinson Award Recipient - News and Events - Samvera","og:title":"2022 Julie Allinson Award Recipient - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/2022-Julie-Allinson-Award-Recipient"}},"__N_SSG":true}