{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are delighted to announce that Case Western Reserve University has become the Hydra Project’s 25th formal Partner. The University, based in Cleveland, Ohio, has been a Fedora user since 2006 and is now adopting Hydra “for the redevelopment of \\[its\\] platform to accommodate a modern landscape of scholarship”. Arnold Hirshon, CWRU’s Associate Provost and University Librarian, writes “We look forward to continuing to demonstrate our commitment to the goals of the Hydra Project as a Partner, and look forward to working alongside and learning from existing and new Partners going forward.” We warmly welcome them to their bigger role in the Hydra Community.\n\nHydra’s Partners formally commit to a shared responsibility to promote the well-being and development of the Hydra Project. In addition to its 25 Partners Hydra has a considerable further number of adopters and, on the basis of conversations at the recent Open Repositories Conference in Helsinki, we believe that many more institutions are about to adopt it or are seriously considering using Hydra as part of their digital library provision.\n","frontmatter":{"title":"Case Western Reserve University becomes Hydra’s 25th Partner!","date":"2014-08-01","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Case Western Reserve University becomes Hydra’s 25th Partner! - News and Events - Samvera","og:title":"Case Western Reserve University becomes Hydra’s 25th Partner! - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/case-western-reserve-university-becomes-hydras-25th-partner"}},"__N_SSG":true}