{"pageProps":{"content":"\nSamvera is first and foremost about the people participating in a community anchored by the belief that together, we can achieve so much more than we could alone.  The Samvera Community thrives due to its diversity in people, institutions, perspectives and skills aligned around a common, shared purpose to provide solutions for sustainable, durable asset management. This shared purpose is continually affirmed and evolved for, and by, the Community.  Resources are provided that foster communication and collaboration both virtually and face-to-face, acknowledging the power of connectedness.\n\nSamvera realizes that one size (or solution) will not fit all. Samvera offers a flexible framework rather than a single closed application.  It is designed so that adopters can each have their own design mix of features; variation is part of the plan.  Equally, the Community recognizes that not all adopters will have the resources to create and maintain their own Samvera variant and to that end offers an evolving array of full-featured “solution bundles” that can be used by smaller teams or offered as a hosted solution.\n\nSamvera encourages new adopters, people with varied expertise, deep engagement and so organizes (and encourages others to organize) interest groups, working groups, training and workshops.\n\nSamvera believes in being inclusive, open and transparent in all it does: code, designs, and discussions.\n\nSamvera provides software designed to make a developer’s life easier.\n\nSamvera Partners are committed to contributing back to the project: code for the core, documentation, design patterns and more.\n\nSamvera designs for re-use.\n","frontmatter":{"title":"Philosophy","date":"2016-10-07"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Philosophy - About Samvera - Samvera","og:title":"Philosophy - About Samvera - Samvera","og:type":"website","og:url":"https://samvera.org/about/philosophy"}},"__N_SSG":true}