{"pageProps":{"content":"\n[See our full Community Guidelines, Code of Conduct, and incident response information on the Samvera wiki](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405212316/Samvera+Code+of+Conduct+and+Anti-Harassment+Policy)\n\n**Expectations for Respectful Communication**\n\nThe Samvera Community is dedicated to providing a welcoming and positive experience for all its members, whether they are at a formal gathering, in a social setting, or taking part in activities online.  The Samvera Community welcomes participation from people all over the world and these community members bring with them a wide variety of professional, personal and social backgrounds; whatever these may be, we treat colleagues with dignity and respect.\n\nCommunity members communicate primarily in English, though for many of them this is not their native language. We therefore strive to express ourselves simply and remember  that unnecessary use of jargon and slang will be a barrier to understanding for many of our colleagues.  We are sensitive to the fact that the international nature of the community means that we span many different social norms around language and behaviour and we strive to conduct ourselves, online and in person, in ways that are unlikely to cause offense.\n\nSamvera conversations are often information-rich and intended to generate discussion and debate.  We discuss ideas from a standpoint of mutual respect and reasoned argument.\n\n**Anti-Harassment Policy**\n\nThe Samvera Community does not  tolerate harassment in any form. Sexual or discriminatory language and imagery is not appropriate for any event venue, including talks, or any community channel such as Slack-based chat rooms or mailing lists.\n\nHarassment includes: offensive verbal comments related to sex, gender, ethnicity, nationality, socioeconomic status, sexual orientation, disability, physical appearance, body size, age, race, religion; sexual or discriminatory images in public spaces; deliberate intimidation; stalking; harassing photography or recording; sustained disruption of talks or other events; inappropriate physical contact; and unwelcome sexual attention.\n\nParticipants asked to stop any harassing behavior are expected to comply immediately.\n\nWe expect participants to follow the Code of Conduct and Anti-Harassment Policy at all meeting venues, meeting-related social events, community gatherings, and online communication channels. Participants violating the Code of Conduct or Anti-Harassment Policy may be sanctioned or expelled at the discretion of the Incident Response Team in accordance with the Samvera Code of Conduct Incident Response Manual.\n\n**Reporting Harassment and Code of Conduct Violations**\n\nIf you are at a conference or other event, find the on-call Samvera Community Helpers ([email](mailto:helpers@samvera.org)) who should be wearing an identifiable Samvera Community Helpers badge or a rainbow lanyard. If you can't find any of these, there will be other staff available to help if the situation calls for immediate action.\n\nIf you are in the Samvera Community Slack, contact one of the Samvera Community Helpers via direct message. You can direct message the Community Helper of your choice by clicking the + next to Direct Message and typing in their name.\n\nRead more about [How to Report a Code of Conduct Violation](https://samvera.atlassian.net/wiki/spaces/samvera/pages/1814233093) and what you can expect in the process.\n\nvalue your participation in the Samvera Community and your support in keeping it a safe, welcoming, and friendly space for fellow participants!\n\n**Code of Conduct Incident Response** \n\nReports of Code of Conduct or Anti-Harassment Policy violations will be addressed by the Incident Response Team, which consists of trained and vetted Community members who follow a detailed Incident Response Plan.\n\nSamvera event organizers, Response Team members, and Community Helpers can be identified by their name badges. These volunteers can help participants contact hotel/venue security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the event.\n\n**Sanctions**\n\nParticipants asked to stop any offending behavior are expected to comply immediately. Incident Response Team members will follow the Response Plan process and may take any action they deem appropriate, including warning the offender, expulsion from the Samvera event, or banning the offender from a chatroom or mailing list.\n\nSpecific sanctions may include but are not limited to:\n\n\\-- Warning the offender to cease their behavior and that any further reports will result in other sanctions\n\n\\-- Requiring that the offender avoid any interaction with, and physical proximity to, the incident reporter for the remainder of the event\n\n\\-- Early termination of a talk that violates the policy\n\n\\-- Not publishing the video or slides of a talk that violated the policy\n\n\\-- Not allowing a speaker who violated the policy to give (further) talks at the event\n\n\\-- Immediately ending any event volunteer responsibilities and privileges the offender holds requiring that the offender not volunteer for future Samvera events (either indefinitely or for a certain time period)\n\n\\-- Requiring that the offender immediately leave the event and not return\n\n\\-- Banning the offender from future events (either indefinitely or for a certain time period)\n\n\\-- Notifying the offender’s institution or organization that the violation has occurred\n\n\\-- Banning the offender from any (or all) Samvera Community channels\n\n\\-- Publishing an account of the offending event as outlined in the Incident Response Plan\n\n**License** \n\nThis document is licensed under Creative Commons BY-SA.  It is based on a document originally developed by the Open Repositories conference.\n","frontmatter":{"title":"Samvera Code of Conduct and Anti-Harassment Policy","date":"2021-08-04"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Samvera Code of Conduct and Anti-Harassment Policy - About Samvera - Samvera","og:title":"Samvera Code of Conduct and Anti-Harassment Policy - About Samvera - Samvera","og:type":"website","og:url":"https://samvera.org/about/samvera-code-of-conduct-and-anti-harassment-policy"},"sideNav":[{"date":"2022-04-05","slug":"samvera-2021-annual-report","title":"Annual Report"},{"date":"2021-08-04","slug":"samvera-code-of-conduct-and-anti-harassment-policy","title":"Samvera Code of Conduct and Anti-Harassment Policy"},{"date":"2017-04-11","slug":"interest-working-groups","title":"Interest and Working Groups"},{"date":"2016-12-06","slug":"licensing","title":"Licensing"},{"date":"2016-12-06","slug":"samvera-community-sourced-software","title":"Samvera is Community Sourced Software for Repository Solutions"},{"date":"2016-12-05","slug":"faq","title":"FAQ"},{"date":"2016-10-07","slug":"governance","title":"Governance and Philosophy"},{"date":"2016-10-07","slug":"philosophy","title":"Philosophy"}],"sideNewsAndEvents":[{"date":"2022-09-08","slug":"2022-Julie-Allinson-Award-Recipient","title":"2022 Julie Allinson Award Recipient"},{"date":"2022-08-01","slug":"Samvera-Partner-Profile-WGBH","title":"Samvera Partner Profile: WGBH"},{"date":"2022-06-15","slug":"call-for-samvera-connect-2022-proposals","title":"Call for Samvera Connect 2022 Proposals"},{"date":"2022-06-13","slug":"samvera-partner-profile-university-of-hull","title":"Samvera Partner Profile: University of Hull"},{"date":"2022-05-19","slug":"samvera-partner-profile-get-to-know-hyku-for-consortia","title":"Samvera Partner Profile: Get to Know Hyku for Consortia"},{"date":"2022-05-16","slug":"announcing-the-release-of-hyku-4-0","title":"Announcing the release of Hyku 4.0"},{"date":"2022-05-11","slug":"samvera-virtual-connect-2022-recordings","title":"Samvera Virtual Connect 2022 recordings"},{"date":"2022-04-25","slug":"program-now-available-for-samvera-virtual-connect-may-4-5-2022","title":"Program now available for Samvera Virtual Connect, May 4-5, 2022"},{"date":"2022-04-06","slug":"call-for-proposals-extended-to-4-15-for-samvera-virtual-connect-2022","title":"Call for Proposals extended to 4/15 for Samvera Virtual Connect 2022"},{"date":"2022-04-05","slug":"samvera-community-2021-annual-report","title":"Samvera Community 2021 Annual Report"},{"date":"2022-03-15","slug":"call-for-proposals-for-samvera-virtual-connect-2022","title":"Call for Proposals for Samvera Virtual Connect 2022"},{"date":"2021-10-04","slug":"see-the-schedule-and-register-for-samvera-connect-2021-online","title":"See the schedule and register for Samvera Connect 2021 Online"},{"date":"2021-09-22","slug":"registration-now-open-for-samvera-connect-2021-online","title":"Registration now open for Samvera Connect 2021 Online"},{"date":"2021-08-31","slug":"call-for-proposals-extended-to-sept-13th-samvera-connect-2021-online","title":"Call for proposals EXTENDED to Sept 13th - Samvera Connect 2021 Online"},{"date":"2021-07-20","slug":"take-a-virtual-tour-of-samvera-repositories","title":"Take a Virtual Tour of Samvera Repositories"}]},"__N_SSG":true}