{"pageProps":{"content":"\nThe Program Committee for Samvera Connect 2023 is pleased to announce the Call for Proposals for workshops, presentations, panels, lightning talks, and posters. These will be offered in person at our conference October 23-26, 2023 in Philadelphia.\n\n[Full details on the Connect 2023 homepage](https://samvera.atlassian.net/wiki/spaces/samvera/pages/2174877699/Samvera+Connect+2023)\n\n[Form for all submissions](https://forms.gle/enGVVnv6m7qLAnoX7)\n\n**Submissions are due by <span style=\"text-decoration:underline;\">June 21st, 2023</span> and extensions from this date are not expected.** \n\nWe want to have the schedule available for everyone to review when making a case to attend our first in person Samvera conference since 2019!\n\nOur goal is to offer content valuable to attendees from a wide range of experiences and backgrounds – from new and potential adopters of Samvera technologies, to expert Samverans. We want to serve developers, administrators, repository managers, sysops, metadata librarians, and everyone else who makes up the Samvera Community.\n\nWe are seeking proposals for the following:\n\n\n\n* 90 minute, 3 hour, and 6 hour workshops (workshop day is October 23rd)\n* 20 minute presentations\n* 40 minute panels \n* 5 minute lightning talks\n* Posters\n\nPlease help us make this year’s Samvera Connect conference a great event! \n","frontmatter":{"title":"Call for Proposals for Samvera Connect 2023 in Philadelphia","date":"2023-05-25","categories":["news","events"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Call for Proposals for Samvera Connect 2023 in Philadelphia - News and Events - Samvera","og:title":"Call for Proposals for Samvera Connect 2023 in Philadelphia - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/call-for-proposals-samvera-connect-2023"}},"__N_SSG":true}