{"pageProps":{"blogPost":{"title":"Julie Hardesty Receives the 2023 Julie Allinson Award","slug":"2023-julie-allinson-award","publishDate":"2023-08-29T00:00+00:00","content":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"The Selection Committee is pleased to announce that the recipient of the 2023 ","nodeType":"text"},{"data":{"uri":"https://samvera.atlassian.net/wiki/spaces/samvera/pages/1851293697/The+Julie+Allinson+Award"},"content":[{"data":{},"marks":[],"value":"Julie Allinson Award","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":" is ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"Julie Hardesty from Indiana University.","nodeType":"text"},{"data":{},"marks":[],"value":" The annual award recognizes an individual who has made an outstanding contribution to the Samvera Community, and honors the late Julie Allinson, a beloved Samvera Community member who was an incredible mentor, teacher, contributor, and friend.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Julie Hardesty was jointly nominated by Jon Dunn (Indiana University), Jessica Hilt (University of California, San Diego), and Rebekah Kati (University of North Carolina at Chapel Hill). In their nomination letter, they nominated Julie for the award to celebrate her \"exceptional technical leadership, invaluable mentorship, and relentless dedication to championing the vital cause of equity, diversity, and inclusion within our community.\"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The nominators highlighted that even after completing her service as the Hyrax Product Owner, \"Julie tirelessly advocates for new developers and is a key founding member of the Developer Onboarding Working Group. In each Developer Congress that she has been involved in, she has created space and given her time to teach and guide new contributors in building their own local instances of Hyrax. In her interactions with novice contributors, she demonstrates unwavering patience, skillfully ushering them through uncharted waters while championing novel processes and testing methodologies. She is always willing to take the time to answer questions and help others. Her unwavering support and commitment to these educational initiatives have significantly enriched our community's growth trajectory.\"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"\"Just as Julie Allinson herself exemplified the transformative power of one person's contributions, so too does Julie Hardesty embody this spirit. Her unwavering commitment, resolute leadership, and unflagging advocacy have undeniably left an indelible mark upon our community, aligning harmoniously with the values held dear by the Julie Allison Award.\"","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Congratulations Julie, and thank you for your outstanding and continuing contributions to the Samvera Community!","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Julie will receive the award in person at the ","nodeType":"text"},{"data":{"uri":"https://samvera.atlassian.net/wiki/spaces/samvera/pages/2174877699/Samvera+Connect+2023"},"content":[{"data":{},"marks":[],"value":"Samvera Connect 2023 Conference","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":" in Philadelphia. We invite you to ","nodeType":"text"},{"data":{"uri":"https://samvera.atlassian.net/wiki/spaces/samvera/pages/1851293697/The+Julie+Allinson+Award"},"content":[{"data":{},"marks":[],"value":"consider contributing to the Julie Allinson Award Fund","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":", which provides for a cash award and plaque to be presented to the recipient each year.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"tag":["news"]},"markdownContent":null,"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Julie Hardesty Receives the 2023 Julie Allinson Award - News and Events - Samvera","og:title":"Julie Hardesty Receives the 2023 Julie Allinson Award - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/2023-julie-allinson-award"}},"__N_SSG":true}