{"pageProps":{"blogPost":null,"markdownContent":{"content":"\n**The full [Samvera Virtual Connect 2023 Program](https://samvera.atlassian.net/wiki/spaces/samvera/pages/2166882321/Samvera+Virtual+Connect+2023+Program) is now available!**\n\nJoin us on May 2-3 for a great lineup of presentations, lightning talks, and updates relevant to developers, managers, librarians, and anyone with an interest or investment in Samvera technologies. [Registration is free!](https://www.eventbrite.com/e/samvera-virtual-connect-2023-tickets-615165355137) The conference runs from 11AM - 2:30PM EDT each day.\n\nSamvera Virtual Connect is an opportunity for Samvera Community participants to gather online to learn about initiatives taking place across interest groups, working groups, local and collaborative development projects, and other efforts. This spring virtual event is open to anyone who would like to catch up on Community developments, make new connections, and learn more about the Samvera Community.\n\nWe hope to see you next week!\n","frontmatter":{"title":"See the full program and register for Samvera Virtual Connect 2023","date":"2023-04-25","categories":["news","events"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"See the full program and register for Samvera Virtual Connect 2023 - News and Events - Samvera","og:title":"See the full program and register for Samvera Virtual Connect 2023 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/samvera-virtual-connect-full-program"}},"__N_SSG":true}