{"pageProps":{"content":"\nSamvera is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future.\n\nSamvera was conceived because we believe that no single system can provide the full range of repository-based solutions for a given institution’s needs, and that no single institution can resource the development of a full range of solutions on its own.  Samvera means ‘togetherness’ in Icelandic, and espouses the value of working together to create solutions that address shared challenges. The Samvera (originally called Hydra) Community benefits from the breadth and depth of knowledge that its adopters bring and, in particular, from the contributions of [its formal Partners](https://samvera.org/samvera-partners/) who commit to its long term development and viability.\n\nWorking together, the Samvera Community continues to develop a common infrastructure with the flexibility to tailor solutions to specific demands and workflows. Our software leverages other [“best in class” open source software](https://samvera.org/samvera-open-source-repository-framework/technology-stack/) to provide a framework within which adopters can create a customized solution or choose from “off-the-shelf” solution bundles. The software embraces open, international standards, where possible.  The community adheres to acknowledged “best practice” for software design and development, learning from each other without duplicating effort.\n\nQuestions are always welcome. Take a look in our [FAQ](https://samvera.org/samvera-community-sourced-software/faq/) and across the website, or join us on our [samvera-community list or Samvera Slack channel](https://samvera.org/getting-started/communication/) to get input from the community.\n","frontmatter":{"title":"Samvera is Community Sourced Software for Repository Solutions","date":"2016-12-06"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Samvera is Community Sourced Software for Repository Solutions - About Samvera - Samvera","og:title":"Samvera is Community Sourced Software for Repository Solutions - About Samvera - Samvera","og:type":"website","og:url":"https://samvera.org/about/samvera-community-sourced-software"},"slug":"samvera-community-sourced-software"},"__N_SSG":true}