{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are delighted to announce that the Institute for Museum and Library Services (IMLS) has awarded grants to two Hydra-related projects.\n\nThe Boston Public Library and the University of Utah have secured funding for \"Newspapers in Hydra\".\n\nThe project will create: (1) a shareable, system- and programming-language-agnostic RDF-based data model addressing structural and descriptive metadata features unique to digitized newspapers; (2) a set of modular, open-source plugins for the popular Hydra/Fedora digital repository framework for ingesting, describing, discovering, displaying, and disseminating digitized newspaper content; and (3) a community of practitioners -- including developers, librarians, content specialists, and managers -- dedicated to addressing challenges and collaborating on best practices associated with managing digitized newspapers.\n\nNorthwestern and Indiana Universities have secured funding for \"Avalon Media System: Integrating audiovisual collections with research, digital preservation, and a sustainable developer community.\"\n\nThe aim of this two-year project is to increase adoption of Avalon within the library and archives community by enhancing the value proposition of Avalon and carrying out work to help ensure sustainability: (1) Integrate Avalon within the Hydra community. We will adapt Avalon to make use of the current Hydra open source repository software stack and will engage members of the Hydra community in development through community sprints. We will also increase the modularity of Avalon so that its components can be more easily integrated into other Hydra-based repository systems, including Hydra-in-a-Box, to provide time-based media access; (2) Implement a cloud-hosted Software-as-a-Service (SaaS) version of Avalon. We will work with Lyrasis and DuraSpace on the establishment of a hosted SaaS offering by conducting pilots to help provide cost modeling for Avalon as a cloud based service; (3) Connect Avalon to media preservation systems and workflows. We will connect Avalon to long-term digital preservation solutions and improve interoperability with workflow and management tools in order to provide a complete AV preservation and access platform, by working with Artefactual Systems to integrate Avalon with the Archivematica platform; (4) Enable interoperability with scholarly tools. The Avalon technical team will take a leadership role with the International Image Interoperability Framework (IIIF) by contributing to the creation of an AV interoperability spec and providing a demonstration implementation.\n\nOur congratulations to both teams!\n","frontmatter":{"title":"IMLS grants for two Hydra-related projects","date":"2017-04-19","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"IMLS grants for two Hydra-related projects - News and Events - Samvera","og:title":"IMLS grants for two Hydra-related projects - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/imls-grants-two-hydra-related-projects"}},"__N_SSG":true}