{"pageProps":{"content":"\nWe’re pleased to announce the release of ActiveFedora 9.1.0 and 9.1.1.  9.1.0 has a number of new features and 9.1.1 was released when we found a small bug just after the release of 9.1.0.\n\nNew features:\n\nThe has\\_attributes() method was deprecated and replaced with property(). The property() method previously was used to declare only RDF properties, but now you can use it to declare properties that are delegated to an XML file too. Here’s an example:\n\nclass Book < ActiveFedora::Base contains ‘descMetadata’, class\\_name: ‘CodexMetadata’ property :title, delegate\\_to: ‘descMetadata’, multiple: false end\n\nAdditionally you can declare your indexing hints right in the model on the property, just like you would do for a RDF property:\n\nproperty :title, delegate\\_to: ‘descMetadata’, multiple: false do |index| [index.as](http://index.as/) :stored\\_searchable end\n\nThis release also contains many bug fixes including:\n\n- has\\_and\\_belongs\\_to\\_many associations finding inverse relationships\n- Finding the best model to instantiate when it is inherited\n- preventing models from loading into the wrong class\n- sorting of versions by date (rather than string)\n- many more!\n\nSee the full list here:\n\n[https://github.com/projecthydra/active\\_fedora/releases/tag/v9.1.0](https://github.com/projecthydra/active_fedora/releases/tag/v9.1.0) Thanks, as ever, to those involved!\n","frontmatter":{"title":"Active Fedora 9.1.0 released","date":"2015-04-20","categories":["news","software-updates"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Active Fedora 9.1.0 released - News and Events - Samvera","og:title":"Active Fedora 9.1.0 released - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/active-fedora-9-1-0-released"}},"__N_SSG":true}