{"pageProps":{"content":"\nThe Program Committee for Samvera Connect 2019 is pleased to announce the Call for Proposals of Presentations and Panels. As in the past, our goal is to serve the needs of attendees from an ever-widening range of experience and background (potential adopters, new adopters, expert Samverans; developers, managers, sysops, metadata librarians, etc.). We are seeking proposals for 20-minute presentations (+5 minutes for questions), short (25 minute) and long (50 minute) panels. The CFP will remain open until 4th August; between now and then you can expect a number of reminders and some pointers for areas we would particularly like to see covered. Notifications will follow shortly after the closing date. CFPs for lightning talks and posters will follow nearer the time of the conference.\n\nProposals should be submitted using [the form that you will find here](https://forms.gle/A1M7AZRKreog3RE56). So – get your thinking caps on and help us make this year’s Samvera Connect conference another great event! FYI: Registration will open on July 1st and there is already a lot of relevant information (including the workshops schedule) on the conference website/wiki at [connect2019.samvera.org](https://connect2019.samvera.org). Please feel free to share this information with interested colleagues or relevant lists.\n","frontmatter":{"title":"Connect 2019 CfP for presentations and panels","date":"2019-06-23","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Connect 2019 CfP for presentations and panels - News and Events - Samvera","og:title":"Connect 2019 CfP for presentations and panels - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/connect-2019-cfp-for-presentations-and-panels"}},"__N_SSG":true}