{"pageProps":{"content":"\n**OR2015 NEWS: Preliminary Program Information Now Available; Remember to Register and Reserve Your Hotel Room**\n\nFrom the OR2015 Program Co-Chairs:\n\nWe are pleased to announce that information on accepted paper, panel, and 24×7 sessions at Open Repositories 2015 is now available on the OR2015 conference website: [http://www.or2015.net/](http://www.or2015.net/)\n\nOpen Repositories 2015, taking place in Indianapolis on June 8-11, received an unprecedented number of proposals this year, with 240 proposals submitted across the conference and interest group tracks. This has also been the most selective Open Repositories, and only 38% of conference paper and panels were accepted in the main track. We have accepted 6 panels, 21 24×7’s (including Rants and Raves), 37 papers and 60 posters which will all give an exciting snapshot of work in the open repositories community.\n\nThe Program Committee would like to take this opportunity to again thank all of our reviewers who took time to review workshops, papers, panels, 24×7’s and posters. Please stay tuned for more information on the schedule and interest group presentations, which we will post later in April.\n\n**\\*\\* Reminder: Register and reserve your hotel room \\*\\***\n\n[Online registration](http://www.or2015.net/registration/) for OR2015 is currently open, and participants can save $50 by registering by May 8. [Special negotiated room rates](http://www.or2015.net/conference-hotel-and-travel/) at the conference hotel are available until May 16. For more information, please visit the conference website: [http://www.or2015.net/](http://www.or2015.net/)\n\nWe look forward to seeing you at OR2015!\n\nHolly Mercer, William Nixon, and Imma Subirats\n\nOR2015 Program Co-Chairs\n\n \n\nJon Dunn, Beth Namachchivaya, Julie Speer, and Sarah Shreeves\n\nOR2015 Conference Organizing Committee\n","frontmatter":{"title":"OR2015 News","date":"2015-04-20","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"OR2015 News - News and Events - Samvera","og:title":"OR2015 News - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/or2015-news"}},"__N_SSG":true}