{"pageProps":{"content":"\n_From the [Hyku for Consortia](https://hykuforconsortia.palni.org/news/pledge-drive-to-advance-the-samvera-hyrax/hyku-valkyrization-project) Team_\n\nHyku for Consortia is [leading a pledge drive](https://docs.google.com/document/d/10A0_UhYiKyC28qQCgeWtsD4x3V24qifDarX6zPRShlg/edit?usp=sharing) to raise funds to move Valkyrie for Hyrax work forward in a series of development sprints by [SoftServ ](https://softserv.scientist.com/)from May-June 2023. The goal is to collect $50,000-$100,000 in funds to advance this work as soon as possible.\n\nValkyrie for Hyrax has been a promise to Samvera users for a few years. So much excellent work has been done here, but community resources have been constrained to get it across the line. Completing this work would provide a number of important benefits to the community:\n\n* Long-desired options beyond Fedora 4 for existing Samvera users, including Postgres or Fedora 6 backed Hyrax\n* Removal of what has been a “let’s wait” blocker for institutions who have delayed upgrades\n* Attractiveness of Samvera solutions to potential adopting institutions who have been hearing about Valkyrie and waiting to act\n* Interest from service providers and a path to keep their engagement in the community viable\n\n### Scope:\n\nThere are three main milestones that we as a community want to accomplish, to be targeted in this order of priority: \n\n* Milestone 1 is to create a fully functioning version of Hyrax that is backed by Postgres. \n* Milestone 2 is to pave a well-established workflow for live-migrating an existing Fedora 4-backed Hyrax repository to Valkyrie Postgres-backed Hyrax repository. \n* Milestone 3 is to have the Fedora 6 Valkyrie adapter fully working in Hyrax. \n\nThe pledge drive is focused on Milestone 1 with any remaining funds dedicated to Milestone 2 in the May-June 2023 period.\n\nIf you have end-of-year funds, and would like to support immediate work on this project, please consider joining the pledge. See the [scope of work document for full details and how to pledge](https://docs.google.com/document/d/10A0_UhYiKyC28qQCgeWtsD4x3V24qifDarX6zPRShlg/edit?usp=sharing).\n\nOrganizations can also contribute developer and/or software testing time to the community effort. Multiple institutions will be leading sprints in August and September 2023. More information will be shared soon.\n\nSee the [Samvera wiki](https://samvera.atlassian.net/wiki/spaces/samvera/pages/2162491393/Valkyrized+Hyrax+Community+Effort+2023) for more information.\n","frontmatter":{"title":"Pledge drive to advance the Samvera Hyrax/Hyku Valkyrie integration project","date":"2023-04-27","categories":["news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Pledge drive to advance the Samvera Hyrax/Hyku Valkyrie integration project - News and Events - Samvera","og:title":"Pledge drive to advance the Samvera Hyrax/Hyku Valkyrie integration project - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/Pledge-drive-to-advance-hyrax"}},"__N_SSG":true}