{"pageProps":{"content":"\nOur generous hosts at Washington University in St Louis have made provision for the award of up to three scholarships to Connect 2019 (22-25 October, Washington University in St Louis).  These scholarships will cover the cost of conference registration and three nights' accommodation only.  They do not cover travel expenses, or evening meals.\n\nThe Samvera Connect Scholarships Committee is committed to promoting diversity within the Samvera Community. Anyone who identifies with a group that is historically under-represented at such events (including, but not limited to, African Americans, Latinx, Indigenous Peoples, people with disabilities, cis women, people of transgender experience, and people of non-binary gender) is encouraged to apply.\n\nApplications are open to all Samvera Community participants but priority consideration will be given to first time attendees, early career professionals, applicants from historically under-represented groups, and international applicants.  Closing date 21st August 2019.  [Details and application form here](https://wiki.duraspace.org/display/samvera/Scholarships).\n","frontmatter":{"title":"Samvera announces Scholarships for its Connect 2019 conference","date":"2019-08-01","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Samvera announces Scholarships for its Connect 2019 conference - News and Events - Samvera","og:title":"Samvera announces Scholarships for its Connect 2019 conference - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/samvera-announces-scholarships-for-its-connect-2019-conference"}},"__N_SSG":true}