{"pageProps":{"content":"\nOf interest to the Community:\n\nApril 27, 2015\n\nContact: [http://www.or2015.net/contact-us/](http://www.or2015.net/contact-us/)\n\n**Trinity College Dublin to Host the 2016 Eleventh International Conference on Open Repositories**\n\nThe Open Repositories Steering Committee and Trinity College Dublin (The University of Dublin) are pleased to announce that the Eleventh International Conference on Open Repositories will be held at Trinity College Dublin, Ireland, the week of June 13th 2016.\n\nFounded in 1592, Trinity College Dublin, whose formal name is College of the Holy and Undivided Trinity of Queen Elizabeth near Dublin, is recognized internationally as Ireland’s premier university.\n\nMore information will be available at [Open Repositories 2015](http://www.or2015.net/) (#OR2015) to be held in Indianapolis June 8-11.\n\n**Reminder: Register for OR2015**\n\nInformation on accepted paper, panel, and 24×7 sessions at Open Repositories 2015 is now available on the OR2015 conference website:[http://www.or2015.net/](http://www.or2015.net/). Online registration for OR2015 is open, and participants can save $50 by registering by May 8. Special negotiated room rates at the conference hotel are available until May 16. For more information, please visit the conference website: [http://www.or2015.net/](http://www.or2015.net/).\n","frontmatter":{"title":"Save the dates: Trinity College Dublin to Host the 2016 11th International Conference on Open Repositories","date":"2015-04-27","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Save the dates: Trinity College Dublin to Host the 2016 11th International Conference on Open Repositories - News and Events - Samvera","og:title":"Save the dates: Trinity College Dublin to Host the 2016 11th International Conference on Open Repositories - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news/save-the-dates-trinity-college-dublin-to-host-the-2016-11th-international-conference-on-open-repositories"}},"__N_SSG":true}