{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nWe are pleased to open the call for presentation proposals for Samvera Virtual Connect 2023!  Samvera Virtual Connect will be held May 2-3, 2023, from 11AM - 2PM Eastern time.\n\nSamvera Virtual Connect provides the Samvera Community with a free, informal opportunity to share the work occurring in our institutions and via our collaborative efforts.  Virtual Connect occurs entirely online via Zoom webinar to a live audience across the globe, with presentations recorded for asynchronous viewing.\n\nWe’re looking for submissions from across the entire Samvera landscape, including both local development and community work. Consider the following themes for ideas about submissions that would be welcomed, but also feel free to submit other types of proposals.\n\n\n\n* **“New to Samvera” experiences**: If you or your institution started adopting Samvera technologies recently, how has the journey been so far?\n* **Challenges**: We can all from each other’s failures, pilot projects, performance tuning, and integration challenges\n* **Adaptation**: Have you implemented or are you working on implementing something adapted from another organization in the community?\n* **Integration**: How are you integrating the digital repository into your wider institutional community? How have you integrated Samvera technology with other software and services?\n* **Equity, Diversity, Inclusion, or Anti-Racist** initiatives and challenges in digital repositories\n* **Ways we work together**: Ideas about processes, staffing, and other strategies that help teams work together better\n* **Lightning talks to share your hot takes**: “Hear me out, I think we should try this and here’s why…”\n\nThis year’s Virtual Connect will have two days of programming, during which we’ll be coordinating presentations into thematic blocks based on topic, audience, and time. \n\n**Submit your proposal: [https://forms.gle/7xSgVjjLdAutozVC8](https://forms.gle/7xSgVjjLdAutozVC8)**\n\n**Proposals are due Friday April 7th, 2023.**\n\nWe look forward to your submissions and learning more about the developments and successes of the Samvera Community.\n","frontmatter":{"title":"Call for Proposals: Samvera Virtual Connect 2023","date":"2023-03-23","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Call for Proposals: Samvera Virtual Connect 2023 - News and Events - Samvera","og:title":"Call for Proposals: Samvera Virtual Connect 2023 - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/CFP-Samvera-Virtual-Connect-2023"}},"__N_SSG":true}