{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nThe [Samvera Repository Online Tour](https://samvera.org/samvera-open-source-repository-framework/take-a-tour-of-active-samvera-repositories/) provides an overview of a range of Samvera-based digital repositories and their collections at institutions across the US and UK. Click through to explore how Samvera technologies allow institutions and organizations to organize and provide access to diverse materials -- from oral histories and historic photographs, to student projects and research data. \n\nThe tour was planned by the Samvera Marketing Working Group and created using [StoryMapJS](http://storymap.knightlab.com/) by Lafayette College Libraries student workers Grayce Walker, Deja Jackson, and Khaknazar Shyntassov. A huge thanks to them, as well as to Charlotte Nunes at Lafayette College Libraries Digital Scholarship Services for coordinating the work.\n\nIf you’d like to include your Samvera-based repository on the tour, simply [fill out this form](https://forms.gle/siwPitQHRb3W5LA28).\n","frontmatter":{"title":"Take a Virtual Tour of Samvera Repositories","date":"2021-07-20","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Take a Virtual Tour of Samvera Repositories - News and Events - Samvera","og:title":"Take a Virtual Tour of Samvera Repositories - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/take-a-virtual-tour-of-samvera-repositories"}},"__N_SSG":true}