{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nTowards the end of 2019, we were made aware of two new Samvera-based repositories that you may like to take a look at:\n\nThe Southeastern Baptist Theological Seminary has produced an innovative site which can be driven from a scrolling timeline (as well as a conventional search).  The [SEBTS site can be found here.](https://archives.sebts.edu/)\n\nThe British Library has developed a joint research database in collaboration with a number of partners: National Museums Scotland, Tate, MOLA, British Museum and Royal Botanic Gardens, Kew. The system is built in Samvera Hyku and was developed in collaboration with Ubiquity Press. Each Partner has their own repository but there is a single search portal which interrogates all of them.  The [portal is here](https://iro.bl.uk), and there's a very [full blog post about the system here](https://blogs.bl.uk/living-knowledge/2019/11/british-library-shared-research-repository-launched-in-beta.html).\n\nCongratulations on both of them!\n","frontmatter":{"title":"Some innovative, new Samvera sites","date":"2020-01-09","categories":["news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Some innovative, new Samvera sites - News and Events - Samvera","og:title":"Some innovative, new Samvera sites - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/some-innovative-new-samvera-sites"}},"__N_SSG":true}