{"pageProps":{"content":"\nMuch of Samvera's development is driven by its Interest and Working Groups.  These groups come together to discuss and work on matters of particular importance to the Samvera Community at any given time.  Interest Groups are essentially for discussion around a particular topic; Working Groups are created to perform specific tasks - each Working Group has specific deliverables and a timeframe in which to create them.\n\nSamvera's Interest and Working Groups operate in a transparent and inclusive manner.  Each proposed new Group sets out a charter and posts an open invitation for participants from across the Community.  Generally the meetings are held online and the minutes are posted on Samvera's wiki. Unless there is a clear reason to do otherwise, Groups use existing Samvera mailing lists for communication so that their progress can be shared with the broader Community.  Interest Groups can give rise to Working Groups and vice versa but when a particular Group has fulfilled its objectives it is dissolved.\n\nA list of the current Groups, and links to their pages, can be found on the [Samvera wiki](https://samvera.atlassian.net/wiki/spaces/samvera/pages/422319284/Interest+Group+IG+and+Working+Group+WG+Hub).\n","frontmatter":{"title":"Interest and Working Groups","date":"2017-04-11"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Interest and Working Groups - About Samvera - Samvera","og:title":"Interest and Working Groups - About Samvera - Samvera","og:type":"website","og:url":"https://samvera.org/about/interest-working-groups"},"slug":"interest-working-groups"},"__N_SSG":true}