{"pageProps":{"content":"\nThis post contains a number of important reminders and updates from the Hydra Connect 2015 organizers.  Please read it carefully!\n\nBooking\n\nAt the time of writing, accounting for some tickets set aside for speakers who have still to register, there are only about 40 tickets left for the event.  Our limit of 200 tickets is not extensible, so if you intend coming and you have not yet registered you need to do so very soon – it looks as though we shall sell out.  This year we require registration for any workshops that you hope to attend and so, once registered for the conference, you need to do that too.  All the details at[https://wiki.duraspace.org/display/hydra/Hydra+Connect+2015](https://wiki.duraspace.org/display/hydra/Hydra+Connect+2015) .  The page now has full details and timetables for all the ‘formal’ conference sessions.\n\nPoster Show and Tell\n\nWe hope that all institutions with staff coming to Hydra Connect will contribute to the popular Poster Show and Tell session on the Tuesday afternoon.  There is a list of institutions at [https://wiki.duraspace.org/display/hydra/Poster+sign-up+and+details+of+local+printing+arrangements](https://wiki.duraspace.org/display/hydra/Poster+sign-up+and+details+of+local+printing+arrangements) – please sign up if you haven’t already done so.  The page also has details of local printing arrangements, should you wish to take advantage of them.  We have managed to secure a much cheaper deal than we first anticipated ($26 or $38 depending on size and including delivery to the conference venue).\n\nLightning talks\n\nThe Program Committee has left space on the Wednesday morning for up to 16 lightning talks of no more than five minutes each.  If you’d like to take one of these slots to share some ideas/concerns/rants/raves or whatever, please sign up at [https://wiki.duraspace.org/display/hydra/Lightning+talk+sign-up+page](https://wiki.duraspace.org/display/hydra/Lightning+talk+sign-up+page) .\n\nUnconference sessions\n\nWednesday afternoon and Thursday are given over to ‘unconference sessions’.  These could include presentations (on technical topics, planning and management, professional development, work life balance, or anything else), panel discussions, hackfests, or meetups (it would be a good time for Interest and Working Groups to meet face-to-face).  This year we have a piece of software called Sessionizer which allows people to propose sessions and/or express interest in attending other people’s sessions and which will ultimately produce a timetable to ensure that the most people can attend the greatest possible number of sessions that they have expressed interest in.  Please feel free to register and to propose sessions at[http://connect2015.curationexperts.com/home](http://connect2015.curationexperts.com/home) .  Please also keep an eye on the page and register for things that you find interesting.  The system will remain open until the Tuesday of the conference at which time we need to do the timetabling.\n\nSocial events\n\nApologies that there was a little bit of confusion on the EventBrite site until recently:  the optional conference dinner is on Tuesday 22nd September. (EventBrite had Wednesday in at least one place.)  We shall soon produce some sign-up lists for attendees to create informal dinner groups on the Monday and Wednesday evenings.  These are a good way to find some amenable company for an evening – especially if you are new to the Hydra Community and don’t yet know many others.\n\nWe hope to see you in less than six weeks!\n","frontmatter":{"title":"Hydra Connect 2015 – important updates","date":"2015-08-12","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Hydra Connect 2015 – important updates - News and Events - Samvera","og:title":"Hydra Connect 2015 – important updates - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/hydra-connect-2015-important-updates"}},"__N_SSG":true}