{"pageProps":{"blogPost":null,"markdownContent":{"content":"\n![An illustration of a snowy scene with the text \"Season's Greetings, thank you for your continued support of the Samvera Community\" surrounded by Samvera, Hyrax, Avalon, Hyku, and Valkyrie logos on winter items.](../images/email-samvera-card-2020.png)\n\nAs 2020 draws to a close, we want to share our gratitude for each and every person who has helped the Samvera Community thrive in this difficult year of profound loss and challenge. We could not be the vibrant, welcoming, and valuable open source solution community we are without each and every person who contributed code or documentation, helped answer a question, served on a Working or Interest Group or as a Community Helper, or helped make Samvera Connect On-line a successful event.\n\nWe also want to thank everyone who attended an event, joined the conversation on Slack, or reached out for more information. We’re grateful for your interest and happy to further connect you to the community.\n\nWe hope you will join us in looking forward to 2021 with renewed energy and excitement about what we can accomplish as we go further, together.\n","frontmatter":{"title":"Season's Greetings from the Samvera Community","date":"2020-12-17"}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"Season's Greetings from the Samvera Community - News and Events - Samvera","og:title":"Season's Greetings from the Samvera Community - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/seasons-greetings-from-the-samvera-community"}},"__N_SSG":true}