{"pageProps":{"content":"\nThe Samvera framework uses the best of current repository, search, and user-interface technologies. The separation of data and display, within the Samvera framework, promotes flexibility and extensibility.\n\n#### Flexible\n\nWithin the Samvera framework, one \"body\" -- the digital repository -- supports multiple \"heads\" or tailored, content type-specific applications.\n\n![Samvera repository structure](../images/HydraContentStructure4.gif) Where other repository systems may be tailored to a specific format or medium, requiring specific systems and expertise, the Samvera framework is flexible enough to serve multiple needs.\n\n#### Extensible\n\nThe Samvera framework is architected to extend features based on specific concerns and use-cases. Established features with long-term community commitment are available, such as:\n\n- [Browse Everything](https://github.com/projecthydra/browse-everything) allows your rails application to access user files from cloud storage, such as Dropbox, Skydrive, Google Drive, Box, and a server-side directory share\n- [LDP](https://github.com/projecthydra/ldp) provides a Linked Data Platform and allows publication of RDF data\n\nThe agile and collaborative nature of the Samvera Community also enables experimentation with cutting-edge extensions, which can be added to address unique needs, explore usefulness and possibilities, and eventually gain community commitment.\n","frontmatter":{"title":"Samvera is Flexible and Extensible","date":"2016-12-05"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Samvera is Flexible and Extensible - Why use Samvera? - Samvera","og:title":"Samvera is Flexible and Extensible - Why use Samvera? - Samvera","og:type":"website","og:url":"https://samvera.org/why-use-samvera/samvera-flexible-extensible"}},"__N_SSG":true}