{"pageProps":{"content":"\nWe are happy to announce that (free) registration is now open for Samvera Virtual Connect 2018.\n\n[https://ucsb.zoom.us/webinar/register/WN\\_djjNoNM0TmKqKASxrcI8CQ](https://ucsb.zoom.us/webinar/register/WN_djjNoNM0TmKqKASxrcI8CQ)\n\nThis year's event will be held on Wednesday, 11 July 2018 from 11:00 AM - 2:30 PM EDT / 8:00 AM – 11:30 AM PDT / 16:00-19:30 BST / 15:00-18:30 UTC.\n\nSamvera Virtual Connect (SVC), is an opportunity for Samvera Community participants to gather online to touch base on the progress of community efforts at a roughly halfway point between face-to-face Samvera Connect meetings. Samvera is a growing, active community with many initiatives taking place across interest groups, working groups, local and collaborative development projects, and other efforts, and it can be difficult for community members to keep up with all of this activity on a regular basis. SVC will give the Samvera community a chance to come together to catch up on developments, make new connections, and re-energize itself towards [Samvera Connect 2018](https://wiki.duraspace.org/display/samvera/Samvera+Connect+2018) in Salt Lake City in October.  See the [Virtual Connect wiki page](https://wiki.duraspace.org/display/samvera/Samvera+Virtual+Connect+2018) for further information.\n","frontmatter":{"title":"Samvera Virtual Connect registration open","date":"2018-07-04","categories":["events","news"]},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:image:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Samvera Virtual Connect registration open - News and Events - Samvera","og:title":"Samvera Virtual Connect registration open - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/samvera-virtual-connect-registration-open"}},"__N_SSG":true}