{"pageProps":{"blogPost":null,"markdownContent":{"content":"\nOf interest to Hydranauts going to Helsinki next week:\n\n**OR2014 Update: Scholarship Programme Recipients Selected**\n\n_Helsinki, FI_  Leading up to the kick-off of the [Ninth International Conference on Open Repositories](http://or2014.helsinki.fi/) (#OR2014) next week, the Open Repositories Steering Committee is pleased to announce that recipients of the 2014 Open Repositories Pilot Scholarship Programme have been selected. The Pilot Scholarship Programme is providing financial support for three first-time delegates to attend this year’s conference in Helsinki, June 9-13. The recipients, who are from Estonia, Turkey, and the United Kingdom, were among a strong pool of applicants.\n\nThe Open Repositories Steering Committee instituted the Scholarship Programme to encourage participation by librarians, repository managers, developers and researchers in digital libraries and related fields, who might not otherwise have the resources to attend Open Repositories. The Scholarship Programme covers the cost of full registration, including the conference dinner. We look forward to welcoming the scholarship recipients, and all delegates, to Helsinki next week.\n","frontmatter":{"title":"NEWS RELEASE OR2014 Update: Scholarship Programme Recipients Selected","date":"2014-06-03","categories":["events","news"]}},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"images/1200px-Samvera_logo.png","og:site_name":"NEWS RELEASE OR2014 Update: Scholarship Programme Recipients Selected - News and Events - Samvera","og:title":"NEWS RELEASE OR2014 Update: Scholarship Programme Recipients Selected - News and Events - Samvera","og:type":"website","og:url":"https://samvera.org/news-and-events/news-release-or2014-update-scholarship-programme-recipients-selected"}},"__N_SSG":true}