{"pageProps":{"content":"\n### What is Samvera?\n\nSamvera is an Icelandic word meaning “togetherness.” The Samvera Community is a global community of technologists who create and maintain repository software; you can’t install Samvera, but you can install the repository solutions we develop together including [Avalon Media System](https://www.avalonmediasystem.org/), [Hyrax](https://www.hyrax.samvera.org), and [Hyku](https://www.hyku.samvera.org). Institutions around the world rely on Samvera Community supported software to provide access to their digital content. \n\nSamvera is also a community of practice where software developers and library technologists can support and learn from one another. We have active participation from metadata specialists, repository managers, user experience professionals, and others who contribute their expertise to ensure the software stays relevant and responsive to changing needs.\n\n### Learn more about Samvera\n\n* See the[ Samvera Community Guidelines](https://samvera.atlassian.net/wiki/spaces/samvera/pages/1947631640) to learn how we work together\n* Our[ wiki homepage](https://samvera.atlassian.net/wiki/spaces/samvera) is a great place to start learning about the Community, including our technologies, governance Partners, and more.\n* [Take a tour](https://samvera.org/repository-solutions/take-a-tour-of-active-samvera-repositories) of some Samvera repositories\n* Dive into our code repository [https://github.com/samvera](https://github.com/samvera)\n\n**Join the Samvera Slack workspace**\nThis is the best place to get started with the Samvera Community. Join us for discussion, questions, announcements, interest groups, and working groups. \nFill out this[ form](https://forms.gle/oeLBwbQw9QoCZWTL6) to get a Samvera Slack invitation.\n\n**Join Community Email Lists**\nKeep up with Community announcements, updates, and conversations.[ See all our available lists](https://samvera.atlassian.net/wiki/spaces/samvera/pages/1171226735) and sign up for those that interest you.\n\n### Attend an Interest Group or Technical Call\n\n**[Technical Call](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405211059)**\n\nThere is a weekly Samvera tech call for developers and other folks who are contributing code or are actively using the core Samvera plugins & components. \n\n**[Interest Groups](https://samvera.atlassian.net/wiki/spaces/samvera/pages/422319284)**\n\nAnyone is welcome to attend an Interest Group Meeting to learn more about a Samvera technology, to ask questions, and to hear the latest updates. The Groups include individuals from many different roles including developers, managers, librarians, and others.\n\n**[Avalon User Roundtable](https://samvera.atlassian.net/wiki/spaces/AVALON/pages/1957954091)**\n\nThe Avalon User Roundtable is a community group that meets monthly to talk all things Avalon and AV in the world of libraries and archives. Agenda topics are sourced from the community, and all potential and current Avalon users are invited to attend!  \n\n**[Hyku Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/419533203)**\n\nThe Hyku Interest Group meets to discuss the Hyku repository application. Based on Hyrax, Hyku is intended to be an easy-to-install, easy-to-configure, feature-rich multi-tenancy solution. Hyku is designed to reduce barriers to effective asset management and preservation for collections and content types of many kinds.\n\n**[Hyrax Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/496632287)**\n\nAnyone is welcome to learn more about[ Hyrax](http://hyrax.samvera.org/), the product roadmap, current initiatives, and to ask questions.\n\n**[Metadata Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405212126)**\n\nThe Samvera Metadata Interest Group (SMIG) is interested in working together on base metadata recommendations for the Samvera Community. The scope of this group concentrates primarily on metadata as it relates to Samvera projects such as Hyrax, Hyku, and Avalon Media System. Types of metadata for which the group has or intends to create recommendations include technical, structural, descriptive, and rights metadata.\n\n**[Repository Management Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405212548)**\n\nProvides a support network and sounding board for anyone working with repositories (no matter what your title!) to ask questions and share implementations. The Group provides collective input on the Hyrax roadmap and feature development, providing use cases, proposals, and providing real-time input on implementation of features.\n\n### Attend an Event or Watch a Previous Event\n\n**[Samvera Calendar](https://samvera.atlassian.net/wiki/spaces/samvera/pages/433553767)**\n\nThis calendar includes information for Samvera Community events, calls, and meetings.\n\n**[Samvera Community Digital Repository](https://repo.samvera.org/)**\n\nFind white papers, slides and recordings from previous events, and other Community materials in our Hyku-based repository.\n\n**Samvera YouTube Channels**\n\nWatch demos and past events on the[ Samvera Community](https://www.youtube.com/channel/UCtOG8TmOIFauObaNc14VnPQ/videos) and[ Samvera Hyku](https://www.youtube.com/channel/UC_m1Ovaaasa2ksyGaqz5i0Q) YouTube channels.\n\n### Talk to the Community Manager\n\nYou're welcome to [email](mailto:heather@samvera.org) or[ schedule a call](https://koalendar.com/events/meet-with-heather-greer-klein) with Heather Greer Klein, the Samvera Community Manager, to discuss the Community, Samvera technologies, ways to get started, for help or other questions. \n\n### Samvera for Developers\n\n#### Where do I start?\n\nThe easiest way to get started developing with Samvera is to install and configure Hyrax.  Two resources will aid you with this - our [general documentation](http://samvera.github.io/) and the [GitHub page with specific installation instructions](https://github.com/samvera/hyrax#getting-started). While it is possible to create your own Samvera application by assembling the right components, and this has been a common practice in the Samvera Community in the past, ongoing maintenance of home grown solutions will be more expensive than sharing maintenance costs with the rest of the Community. \n\n#### Development Resources\n\nYou can find some instructional documentation in [our knowledge base](http://samvera.github.io/index.html). The [samvera-tech mailing list](https://groups.google.com/forum/#!forum/samvera-tech/join) is a good resource, as is the #dev channel on Samvera Slack. Official Samvera code repositories are in the Samvera [Github organization](https://github.com/samvera), and emerging projects are in samvera\\-labs. \n\n#### Samvera for Metadata Professionals\n\nThe Samvera Community contains many metadata professionals who are working together to share patterns and establish best practices. You can connect with many of them via the [Samvera Metadata Interest Group](https://samvera.atlassian.net/wiki/spaces/samvera/pages/405212126/Samvera+Metadata+Interest+Group), the [samvera-tech mailing list](https://groups.google.com/forum/#!forum/samvera-tech), and on the #metadata channel of Samvera Slack.\n","frontmatter":{"title":"Getting started","date":"2023-07-19"},"openGraphData":{"og:description":"Samvera™ is a vibrant and welcoming community of information and technology professionals who share challenges, build expertise, and create sustainable, best-in-class solutions, making the world’s digital collections accessible now and into the future. Samvera’s suite of repository software tools offers flexible and rich user interfaces tailored to distinct content types on top of a robust back end – giving adopters the best of both worlds.","og:image":"/images/1200px-Samvera_logo.png","og:imageUrl:secure_url":"/images/1200px-Samvera_logo.png","og:site_name":"Getting started - Get Started - Samvera","og:title":"Getting started - Get Started - Samvera","og:type":"website","og:url":"https://samvera.org/get-started/getting-started"},"slug":"getting-started"},"__N_SSG":true}